[{"id": "rule-REG-IEEE 802.11.pdf-2", "section": "802.11", "title": "is the most popular standard for wireless LANs but lacks QoS provisioning", "text": "IEEE 802.11 is the most popular standard for wireless LANs but lacks QoS provisioning\ncapabilities. Recently, a new standard IEEE 802.11e has been proposed for providing Quality of Service", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-3", "section": "802.11", "title": "LANs", "text": "in the IEEE 802.11 LANs. The IEEE 802.11e operates in two modes: a distributed mode and a\ncentralized one. For providing QoS guarantees, the centralized approach is the most promising. The \nIEEE 802.11e standard proposes a Reference Scheduler and an Admission Control Unit (ACU) for \nadmission and management of traffic flows in the centralized approach. Flows register with the \nscheduler and then, based on their QoS requirements, the Reference Scheduler works in a simple round \nrobin manner to allocate transmission times to stations containing the flows. The reference scheduler \nworks fine for constant bit-rate traffic (CBR), but is inefficient for Variable bit-rate traffic (VBR) \nbecause it allocates times to stations based on the average traffic specs of the flows. Numerous \nmultimedia applications such as quality controlled MPEG4 and video conferencing have VBR \ncharacteristics and it is thus mandatory that mechanisms must be present to ensure QoS for these \napplications.", "requirement_type": "mandatory", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-4", "section": "802.11", "title": "(i.e. WiFi) and its limitations for providing QoS and", "text": "In this section, we present IEEE 802.11 (i.e. WiFi) and its limitations for providing QoS and\nthen we present the IEEE 802.11e standard and its provisions for QoS. It should be noticed that much \nwork has been done for providing QoS in wireless and ad hoc networks ([MAN02], [NI04], [NI05],", "requirement_type": "recommended", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-5", "section": "802.11", "title": "because we", "text": "[RAM05]), but will not be discussed in this document. We focus only on IEEE 802.11 because we\nbelieve that it will be the technology the most used for providing QoS.", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-6", "section": "802.11", "title": "standard is relating to the Medium Access", "text": "IEEE adopted it as the first WLAN standard. The IEEE 802.11 standard is relating to the Medium Access\nControl (MAC) layer and the Physical (PHY) Layer. Figure 1 shows the MAC layer and the physical \nlayer standards.", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-8", "section": "802.11", "title": "standards – Z. Mammeri", "text": "2  Introduction to IEEE 802.11 standards – Z. Mammeri\n \n(OFDM) and also defines three different Physical layer technologies: IEEE 802.11a, IEEE 802.11b and \nIEEE 802.11g. \nIEEE 802.11a operates in the 5 GHz band. Theoretically, it provides a data rate of 54 Mbps, but \nmore realistically it achieves throughput somewhere between 20 Mbps to 25 Mbps in normal traffic", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-9", "section": "2.4", "title": "GHz band and has a maximum theoretical data rate of up", "text": "conditions. IEEE 802.11b operates in the 2.4 GHz band and has a maximum theoretical data rate of up\nto 11 Mbps with an average throughput of somewhere between 4 Mbps to 6Mbps. IEEE 802.11g offers \ndelivers rates from 6 Mbps to 54 Mbps. It uses the OFDM modulation.  \n \nb) Basic Architecture", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-10", "section": "802.11", "title": "architecture is composed of several basic components. Some of the important", "text": "The IEEE 802.11 architecture is composed of several basic components. Some of the important\ncomponents and functions are the following (Figure 2): \n", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-11", "section": "802.11", "title": "conformant medium access control", "text": "Station (STA): Any device that contains an IEEE 802.11 conformant medium access control\n(MAC) and physical layer (PHY) interface to the wireless medium (WM). \n \nAccess Point (AP): Any entity that has station functionality and provides access to the \ndistribution services via the wireless medium (WM) for associated stations. \n \nBasic Service Set (BSS): The Basic Service Set (BSS) is the basic building block of a IEEE", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-12", "section": "802.11", "title": "wireless LAN. The BSS consists of a group of any number of stations.", "text": "802.11 wireless LAN. The BSS consists of a group of any number of stations.\n \nBasic Service Area (BSA): The conceptual area within which, the members of the Basic Service \nSet may communicate.", "requirement_type": "optional", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-13", "section": "802.11", "title": "WLAN", "text": "Figure 2. Basic Service Set (BSS) of IEEE 802.11 WLAN\n \n \nc) Distribution System (DS)  \nThe distribution system (DS) is the system used to interconnect a set of BSSs through the Access \npoints. An Access Point in one BSS may communicate with another access point to exchange frames \nfor stations in their respective BSSs. \n \nd) Interframe space (IFS)", "requirement_type": "optional", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-14", "section": "802.11", "title": "spacing is used to separate frames. The length of interframe space determines", "text": "In IEEE 802.11 spacing is used to separate frames. The length of interframe space determines\nwhen the channel can be accessed. Thus, the interframe spacing is used to set prioritized access to the \nchannel. There are four types of interframe spaces, Short Interframe space (SIFS), PCF Interframe \nspace (PIFS), DCF Interframe space (DIFS) and Extended Interframe space (EIFS). \nFigure 3 shows the relationship between the different Interframe spaces. As we can see, the relationship \nbetween these interframe spaces is: SIFS < PIFS < DIFS < EIFS \n\n\nPage 3:", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-16", "section": "", "title": "", "text": "Figure 3. Different Interframe Spaces used in the IEEE 802.11\n \n \nSIFS is the shortest Interframe space and is used for separating packets within a single \ntransmission and for the time to be waited before acknowledgement from the receiving station \ncan be sent.  \n \nPIFS is used by the Access Point (AP) to get prioritized access to the channel before any other \nstations can claim access.  \n \nDIFS is used by stations to gain access to the medium during the contention phase i.e. when the \nAccess Point does not govern the access to the channel. The wireless stations must sense the \nchannel idle for DIFS before trying to access the channel. \n \nEIFS is extended interframe space used whenever there is an error in transmission. The station \nthat transmitted the frame that was not correctly received (the station concludes this when it does \nnot receive an ACK) must wait for EIFS before trying to transmit again.  \n \ne) Hidden Node Problem and RTS/CLS mode \nThe hidden node problem is one of the most common problems in Wireless Networks. This \nproblem takes place in scenarios where there are nodes that are outside the range of each other but within \nthe range of a common receiver. If both (or more) of these stations transmit to the common station \nsimultaneously, then there is a collision.", "requirement_type": "mandatory", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-17", "section": "802.11", "title": "standard provides a mechanism to solve this problem called “Request-to-", "text": "The IEEE 802.11 standard provides a mechanism to solve this problem called “Request-to-\nSend” and “Clear-to-Send” (RTS/CLS) scheme. The station wishing to send data first sends a Request-\nto-Send (RTS) frame to the intended destination station. Upon the reception of this frame, the receiving \nstation sends a Clear-to-Send (CTS) frame. Both the RTS and CTS frames contain the duration of the \ncommunication that is going to take place. This essentially solves the hidden-node problem, but there is \nan overhead associated with the extra messages that have to be exchanged for this scheme.", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-18", "section": "802.11", "title": "WLAN has the basic building block Basic Service", "text": "The network topology of the IEEE 802.11 WLAN has the basic building block Basic Service\nSet (BSS).There are two types of LAN topologies for the Wireless LANs, an Independent Basic Service \nSet (IBSS) and an Infrastructure Basic Service Set (Figure 4).", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-19", "section": "802.11", "title": "LAN", "text": "The independent BSS (IBSS) is the most basic type of IEEE 802.11 LAN. Stations are connected\nto each other through the wireless medium on a peer-to-peer basis. However, all the stations in the IBSS", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-20", "section": "802.11", "title": "LAN is often formed", "text": "stations are able to communicate directly. Because this type of IEEE 802.11 LAN is often formed\n\n\nPage 4:", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-21", "section": "802.11", "title": "standards – Z. Mammeri", "text": "4  Introduction to IEEE 802.11 standards – Z. Mammeri\n \nwithout pre-planning, for only as long as the LAN is needed, this type of operation is often referred to \nas an ad hoc network. \nAn Infrastructure Basic Service Set is a BSS with the central component of Access Point (AP) \nwhich performs the relay function. All stations in the BSS communicate through the AP. Some \nadvantages are that it is simpler since stations no longer need to maintain neighbour relationships, it can \nimprove the range of the BSA and we may utilize some power saving mechanisms for the stations. One \nstation (STA) can associate with only one AP at one time and it is done through the process of \nassociation. The AP may be attached to a wired or wireless Ethernet and hence may provide connection \nto the Internet for the nodes.  \n \nFigure 4. Independent Basic service Set and Infrastructure Basic service Set", "requirement_type": "optional", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-22", "section": "802.11", "title": "standard offers two different modes of operation: a mandatory Distributed", "text": "IEEE 802.11 standard offers two different modes of operation: a mandatory Distributed\nCoordination Function (DCF) and an optional Point Coordination Function (PCF).", "requirement_type": "mandatory", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-23", "section": "802.11", "title": "MAC protocol for accessing the cannel is the Distributed Coordination", "text": "The basic IEEE 802.11 MAC protocol for accessing the cannel is the Distributed Coordination\nFunction. Mechanisms for accessing the channel are independent in the sense that there is not central \nmechanism and stations try on their own to access the channel. It uses the Carrier Sense Multiple Access \nwith Collision Avoidance (CSMA/CA) i.e. listen before talk. Before transmitting each wireless station \nsenses the medium and if the medium is idle for DCF interframe space (DIFS) the frame is transmitted.  \nFigure 5 shows the case of successful transmission from Source to Destination without using \nretransmission and backoff procedure. \n \n \nBackoff time \nDefer transmission \nDIFS \nDIFS \nSource \nDestination \nOther  \nstation \nSIFS \nData \nACK \nContention window \n \nFigure 5. Nominal functioning of CSMA/CA without retransmission. \n \n\n\nPage 5:", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-24", "section": "802.11", "title": "standards – Z. Mammeri", "text": "5  Introduction to IEEE 802.11 standards – Z. Mammeri\n \nIf however, the medium was busy, then the station chooses a random back-off timer which is \nmeasured in terms of time slots. This random back-off is selected on basis of a Contention Window \n(CW) and is chosen in the interval [0, CW].  \nAfter the medium has been idle for at least a DIFS, the back-off timer is decremented by one \nfor each time slot that the medium remains idle. When the timer becomes zero, the frame is transmitted. \nIf however, during the decrementing of the back-off timer, the medium becomes busy, the timer is frozen \nduring that time and resumed after the channel is sensed idle again for more than DIFS.  \nThere are collisions when more than one wireless stations start to transmit simultaneously. \nHence, for being ensured of the successful transmission, upon the reception of a frame, the receiver \nsends an Acknowledgement (ACK) frame to the sender. This ACK frame is sent after the SIFS. If \nhowever, there is no ACK frame received, then the station assumes that there has been a collision. It \nreschedules the frame and enters the back-off procedure again. To reduce the probability of collisions, \nthe station doubles the contention window for each retransmission attempt. The Collision window can \nbe expanded up to a maximum limit of CWmax. After a successful transmission, the contention window \nis reset to CWmin. Even after a successful transmission, before transmitting the next frame, a backoff \nis done, which is called \"post-backoff\".  \nFigure 6 shows a scenario where five stations are competing to access the channel. First, we \nassume that station A is transmitting its data frame. During A’s transmission, new frames arrive at MAC \nsublayer of stations B, C and, D. Since the channel is idle, stations B, C, and D must differ their \ntransmission till the end of A’s transmission. When the channel is sensed idle, stations B, C, and D \nrandomly determine their backoff values before attempting access the channel. Station B (with the \nlowest backoff value) is the next station to win the competition. Stations C and D must wait (and their \nbackoff timers are frozen). At the end of B’s transmission, station D is the next to win the channel access. \nStation C should still wait. However during D’s transmission a new frame arrives at station E MAC \nsublayer. At the end of D’s transmission, station E determines its random backoff value, which is less \nthan the remaining backoff of station C. Thus station E wins the channel access before station C. At the \nend of E’s transmission, station C is alone to compete, thus it can send its data. \n \n \n  Backoff remaining  \n  Time since last waiting DIFS after the channel \nwas sensed idle \nDIFS \nDIFS \nDIFS \nDIFS \nDiffer \n Differ \nDiffer \nDiffer \nStation A \nStation B \nData + SIFS + \nACK  \nStation C \nStation D \nData + SIFS \n+ ACK  \nData + SIFS + \nACK  \nStation E \nData + SIFS \n+ ACK  \nData + SIFS \n+ ACK \n \nFigure 6. Example of competition under CSMA/CA.", "requirement_type": "mandatory", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-25", "section": "802.11", "title": "standard also defines the Point Coordination Function (PCF) which uses a", "text": "The IEEE 802.11 standard also defines the Point Coordination Function (PCF) which uses a\ncentral Point Coordinator (PC) which manages access to the wireless medium and polls stations during \na Contention Free Period (CFP). During CFP, access to the medium is governed and assigned to stations \n\n\nPage 6:", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-26", "section": "802.11", "title": "standards – Z. Mammeri", "text": "6  Introduction to IEEE 802.11 standards – Z. Mammeri\n \nby the Point Coordinator, but during the Contention Period (CP), there is no central authority and all \nthe stations contend for access to the medium. The contention-based period and the contention-free \nperiod alternate and together they form the Super-Frame. The PC shall determine the CFP-Rate and this \nvalue is communicated to other STAs in the BSS in the Beacon frames.  \nPCF uses the PCF Inter Frame Space (PIFS) for accessing the medium, which is shorter than \nthe DIFS and thus has a higher priority. The PC periodically generates a Beacon Frame which is used \nfor timing synchronization and other things. The PC maintains a list for all the stations that it has to poll \nand the PC polls each station according to the list. The poll frame that tells a station to transmit may be \naccompanied by some data that the receiving station then acknowledges. At the end of Contention-Free \nperiod, a frame called CF-End is transmitted to signal the end of Contention-Free period. The CFP is \nstarted by sending a beacon frame during the contention period and since this is contention based access, \nthe CFP may be delayed and hence shortened in its duration. Figure 7 shows the CP and the CFP and a \nshortened CFP. \n \n \nFigure 7. Alternating CP and CFP", "requirement_type": "mandatory", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-27", "section": "802.11", "title": "standard, although being widely used, is not capable of providing QoS", "text": "The IEEE 802.11 standard, although being widely used, is not capable of providing QoS\nguarantees to flows [IEE05]. Since QoS is an increasing need in view of the increasing number of \nmultimedia and other applications which depend on such a mechanism, efforts were made to introduce \na new standard. Therefore, the IEEE 802.11e standard was introduced to address the shortcomings of", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-28", "section": "802.11", "title": "standard to incorporate the QoS provisioning services. IEEE 802.11e introduces a new MAC", "text": "802.11 standard to incorporate the QoS provisioning services. IEEE 802.11e introduces a new MAC\nlayer function, called the Hybrid Coordination Function (HCF). The HCF introduces some components", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-29", "section": "802.11", "title": "standard. Some of the most important new terms", "text": "and techniques that were missing in the IEEE 802.11 standard. Some of the most important new terms\nand concepts that IEEE 802.11e has introduced are the following: \n \nQoS Station (QSTA): A Station that implements the QoS facility. \n \nQoS BSS (QBSS): A BSS that implements the QoS facility. \n \nQoS Access Point (QAP): An Access Point that supports the QoS of the standard. \n \nTransmission Opportunity (TXOP): Time duration during which a QSTA can send a burst of \ndata.  \n \nHybrid Coordinator (HC): A centralized controller for all other stations in the QBSS.  \n \nControlled Access Phase (CAP): Time during which the HC maintains control of the medium. \nThe HCF operates in two modes: the contention-based Enhanced Distributed Coordination \nFunction (EDCF) and the contention-free HCF Controlled Channel Access (HCCA). The HCF function", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-31", "section": "802.11", "title": "standards – Z. Mammeri", "text": "7  Introduction to IEEE 802.11 standards – Z. Mammeri\n \n \nFigure 8. Relationship between DCF, PCF, EDCF and HCCA \n \na) Enhanced Distributed Coordination Function (EDCF) \nThe EDCF is the contention based part of the HCF. It works on the same principles as the DCF \nof IEEE 802.11, but is aimed to improve the contention-based access to channel to provide priorities. \nThe EDCA introduces at MAC layer four Access Categories (ACs) supporting eight User Priorities \n(UPs) also known as Traffic Categories (TCs). Table 1 illustrates the various user priorities, their \nequivalent Access Categories and the typical type of data that these priorities are used. \n \n \nTable 1. Priority classes in IEEE 802.11e \n \nEach Access Category (AC) has its own parameters: CWmin (Minimum contention window), \nCWmax (Maximum Contention window), AIFS (Arbitrary Inter-frame Space which replaces DIFS of \nthe conventional DCF), and TXOPLimit (Transmission Opportunity Limit) \nThe different Access Categories have different priority assigned by setting the above mentioned \nparameters. Contention is within a QSTA between ACs, as well as between QSTAs for medium. Thus, \nthe eight different queues for the eight Traffic Categories within a station can be thought of as having \neight queues inside a station along with QoS parameters that decide their priority. If two traffic \ncategories have their counters zero at the same time, then we say that there has been a collision. Such a \ncollision is also called a virtual collision because it is not an actual collision on the air channel, but it \nhas happened virtually. Nevertheless, the back-off procedure is still executed. Figure 9 shows the traffic \ncategories and the different parameters associated: \n \n\n\nPage 8:", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-32", "section": "802.11", "title": "standards – Z. Mammeri", "text": "8  Introduction to IEEE 802.11 standards – Z. Mammeri\n \n \nFigure 9. Queues for different Traffic Categories \n \nFigure 10 shows the operation of different Traffic Categories within a QSTA. Each TC has its \nown AIFS and backoff window sizes. Thus, we have introduced priority between the different traffic \ntypes. \n \n \nFigure 10. Traffic Categories within a station contending for access \n \n \nIt should be noticed that EDCA works well if the network is not heavily loaded. However, it has \nbeen shown that if the network is heavily loaded, then EDCA still provides expected priority for high \npriority flows, but at the cost of worst performance for lower priority flows. The HCCA mechanism \nthough not very challenging, but is a promising approach and is discussed next. \n \nb) HCF controlled Coordination Function (HCCA) \nHCCA is the contention-free mode of the HCF. A central entity governs access to the channel. \nStations register for access to channel by giving the Traffic Specs of the different streams that they \ncontain and the QoS Access Point (QAP) polls stations to send their data. The beacon delay problem is \n\n\nPage 9:", "requirement_type": "recommended", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-33", "section": "802.11", "title": "standards – Z. Mammeri", "text": "9  Introduction to IEEE 802.11 standards – Z. Mammeri\n \nsolved by not allowing a station to transmit a frame if the transmission will not finish before the next \nbeacon. To address the problem of unlimited transmission time of polled stations, a variable called the \nTXOPlimit is introduced, which limits the transmission opportunity of the polled station. The QAP can \nstart Controlled Access Phases (i.e. Contention-Free Periods) even during the contention period by using \nthe HCCA prioritized access mechanism. The PIFS interval is shorter than AIFS or DIFS. A TCAPlimit \nis defined to limit the TXOPs during a beacon interval and to allow enough space for EDCF.  \nBesides these, IEEE 802.11e also introduces two optimizations techniques that can significantly \nimprove performance: Block acknowledgement and Direct link protocol. \nBlock acknowledgement Mode can be negotiated between the QSTA and the QAP. Once the \nBlock ACK mode has been established, multiple QoS frames are transmitted with SIFS separating them. \nThis optimizes bandwidth as we don’t need ACK for every frame. A single frame is used to acknowledge \nthe reception of multiple frames.  \nDirect Link Protocol introduces the possibility of transmitting frames from one QSTA to another \nbelonging to the same BSS directly, without the need for passing through the QAP. Normally, two \nQSTAs are not allowed to exchange frames directly with each other in a BSS, but only through the QAP. \nTo enhance the performance for cases when the two QSTAs are in the same BSS and have some high \nbandwidth demanding applications running, then the DLP facilitates the efficient use of the transmission \nmedium by allowing the two stations to communicate directly.  \nc) IEEE 802.11e Reference Scheduler and admission control \nUp to eight different traffic classes of different priorities are allowed in the station. Before any \ntraffic for a stream flows, the station sends a QoS request frame to the QAP carrying the Traffic \nSpecifications (TSpecs) of the traffic stream. The Minimum Data Rate, Mean Data Rate, Peak Data \nRate, Burst Size, Minimum PHY Rate, Minimum Service Interval, Maximum Service Interval and Delay \nbound fields in the TSpec express the characteristics of the traffic stream. When the QAP has received \nthese requests, it assigns its Scheduler to calculate service schedule and the TXOP for each given SI \n(Service Interval). The calculation of the scheduled service interval is done as follows: first, the service \nscheduler calculates the minimum of “Maximum SI” of all the admitted streams. Let this minimum be \nm. Second, the scheduler calculates a number smaller than m and which is a sub-multiple of the beacon \ninterval. This is the scheduled SI for all QSTAs with admitted streams. This same process is repeated as \nlong as the maximum SI of the newly admitted stream is larger than the current scheduled service \ninterval. If, however, the maximum SI of the newly admitted stream is smaller than the scheduled service \ninterval, the scheduler needs to change the scheduled service interval to a value smaller than the \nmaximum SI of this stream. The TXOPs also need to be recalculated with the new scheduled SI. If a \nstream is dropped, the scheduler might use the time available to resume contention. The scheduler might \nalso choose to move the TXOPs for the QSTAs following the QSTA dropped to use the unused time. \nHowever, this option might require the announcement of a new schedule to all QSTAs. Different \nmodifications can be implemented to improve the performance of the minimum scheduler. For example, \na scheduler might generate different scheduled SIs for different QSTAs, and/or a scheduler might \nconsider accommodating retransmissions while allocating TXOP durations. \nWhen a new stream requests admission, the admission control process is done in three steps. \nFirst, the ACU (Admission Control Unit) calculates the number of frames that arrive at the mean data \nrate during the scheduled SI for this stream. Second, the ACU calculates the TXOP duration that needs \nto be allocated for the stream. Third, the ACU performs a final check before accepting the new flow to \nbe sure that all the admitted streams have guaranteed access to the channel.", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-34", "section": "802.11", "title": "Networks", "text": "d) QoS for VBR traffic in IEEE 802.11 Networks\nProviding QoS to applications is a challenging yet necessary task. In the case of wireless \nnetworks, the channel is prone to data loss, corrupted packets, high latency and jitter. For the wireless \nscenario, the MAC layer is the most important level for achieving this goal. The QoS can be \ncharacterized as prioritized or parameterized. Parameterized QoS is a strict requirement with \nquantitative bounds such as delay bound, data rate and jitter bound. One of the major weaknesses of \n\n\nPage 10:", "requirement_type": "mandatory", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-35", "section": "802.11", "title": "standards – Z. Mammeri", "text": "10  Introduction to IEEE 802.11 standards – Z. Mammeri\n \nIEEE 802.11e is the inability of its scheduler to handle diverse applications, particularly VBR \nmultimedia applications. It must be noted that this is a serious limitation because today, multimedia \napplications with VBR characteristics form a large portion of the traffic. In the following, we discuss", "requirement_type": "mandatory", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-37", "section": "802.11", "title": "fails to provide", "text": "medium and there is no concept of priority. The DCF mode of the IEEE 802.11 fails to provide\nthe desired bandwidth, delay or jitter requirements. The DCF provides only for best-effort \nservices. Therefore for multimedia applications that depend heavily on delay bounds, the \nperformance of DCF is unacceptable.  \n", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-38", "section": "802.11", "title": "PCF: The PCF mode attempts to provide QoS by using a", "text": "QoS limitations of IEEE 802.11 PCF: The PCF mode attempts to provide QoS by using a\ncentralized scheduler and polling frames, thus avoiding collisions that occurred due to \ndistributed access in the DCF mode. It was meant to provide QoS to time-bounded multimedia \napplications. However, there are at least three main problems with the PCF approach that render \nit unable to provide the required QoS:  \nInefficient central polling scheme: All the communication between two stations in the same \nBSS has to be through the central Access Point. When the amount of traffic increases, \nthis kind of mechanism proves quite wasteful for the bandwidth as the stations are better \noff exchanging directly.  \no Unpredictable beacon delays: The alternating CP and CFP may result in the Beacon \nDelay problem. At TBTT (Target Beacon Transmission Time), a PC schedules the \nbeacon as the next frame to be transmitted. The beacon can be transmitted when the \nmedium has been idle for at least PIFS. However, if at this time (TBTT), if the medium \nis busy due to some unfinished transmissions, the time bounded frames in CFP will \nsuffer. The standard allows stations in Contention Period to transmit even if the \ntransmission will not finish before TBTT. Thus the CFP period starts late and some or \nall flows in it suffer. \no Unknown transmission time of polled stations: A station that has been polled by the PC \ncan send a single frame up to max of 2304 bytes, and that frame may be fragmented. \nFurther, different modulation and coding schemes are specified in IEEE 802.11a, thus \nafter polling a station, the PC cannot tell how long will it take for this station to finish \nits transmission. This disables any attempt to provide QoS to the remaining stations that \nare to be polled during the CFP.  \n \ne) QoS limitations of IEEE 802.11e for Variable bit-rate Traffic  \nTo provide QoS to applications in the wireless environment, the IEEE 802.11e standard has \nbeen proposed. However, the IEEE 802.11e is far from perfect. In certain scenarios and for certain types \nof applications, it fails to provide QoS guarantees. In the proceeding paragraph, we discuss the \nlimitations of the IEEE 802.11e standard and in particular the centralized scheduler. \nIn the HCCA mode, stations send reservation requests to the scheduler and based on the \ninformation provided in the reservation request about the flow, the ACU admits or rejects the flow. Then \nagain, based on the information about the characteristics of the flow, the scheduler allocates TXOPs to \nthe stations and polls stations in a simple round robin manner. However, the information on which the \nscheduler bases time allocation to stations is the averaged information about the characteristics of the \nflows. The assumption is that these traffic flows are constant bit-rate and will continue this trend. The \ntransmission duration of a station always stays the same in the reference scheduler and corresponds to \nthe transmission time of an average sized packet or a burst of average size (whichever takes longer time) \nat the minimum physical rate. When the traffics are variable bit-rate, the performance of the scheduler \ndegrades and it cannot guarantee QoS to the applications.  \nSeveral solutions have been proposed to deal with these limitations of IEEE 802.11e ([MAN02], \n[NI04], [NI05], [RAM05]). Among the proposed solution, we can mention:  \n\n\nPage 11:", "requirement_type": "mandatory", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-IEEE 802.11.pdf-39", "section": "802.11", "title": "standards – Z. Mammeri", "text": "11  Introduction to IEEE 802.11 standards – Z. Mammeri\n \n \nDynamic allocation of additional time to VBR flows: The Access Point gathers queue \ninformation from stations to see if variations from the traffic reservation have caused queue \nbuild-up at QSTAs and if so, then it allocates additional time to prevent high delays.  \n \nVariable service intervals: The authors of this solution use the concept of token bucket of time \nunits or a TXOP timer for each QSTA. The transmission of a long burst in several SI spaced \nintervals leads to poor performance, but if the QSTA can use up its accumulated tokens at such \nneeded instants, such bursts of data can be handled without degrading quality. The TXOP timer \nof a station increases at a constant rate of TD/mSI where TD is its transmission duration and the \nmSI is its minimum Service Interval. The time that the station used in its TXOP is then deducted \nfrom its TXOP timer. Thus over the long interval, a QSTA still has its TXOP equal to its mean \ndata rate but it has more flexibility. \n \nFlexible HCF (FHCF): This approach handles the dynamic variation of the flows by adjusting \nthe TXOPs of these flows, based on queue length estimations. It aims to be fair for both CBR \nand VBR traffic. There are two schedulers, the QAP scheduler and the node scheduler. The QAP \nscheduler calculates the ideal queue length of the TS (Traffic Stream) queues for each QSTA at \nthe beginning of the next SI. When a QSTA sends a QoS data packet, the QAP uses the QoS \ncontrol field of the IEEE 802.11e header to record its queue length at the end of TXOP. The \nQAP knows the time at which this TXOP ends, and hence using the queue length at the end of \nTXOP, the time at the end of TXOP and using other parameters like frame size and application \ndata rate, the QAP scheduler estimates the queue length of a TS at the beginning of the next SI. \nTo handle the case for VBR applications, the FHCF scheme uses a window of w already known \nreal queue measurements to adjust the estimation. Then, the QAP scheduler compares the \nestimated queue length to the ideal queue length and reallocates the TXOP accordingly. The \nnode scheduler also performs almost the same calculations. It has the task of redistributing the \nadditional allocated time to the different TSs within the node.", "requirement_type": "informative", "source_document": "REG-IEEE 802.11.pdf", "page_number": "", "extraction_method": "rule_based"}]