[{"id": "rule-REG-PA DEP of AIR QUALITY.pdf-1", "section": "4", "title": "(1) of the Act ofJanuary 8, 1960", "text": "WHEREAS, DEP is authorized under Section 4(1) of the Act ofJanuary 8, 1960\n(P.L.(1959) 2119), as amended, known as the Air Pollution Control Act (hereinafter", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-2", "section": "4004", "title": "(18» to prepare and develop a general comprehensive plan for the control and", "text": "§4004(18» to prepare and develop a general comprehensive plan for the control and\nabatement of existing air pollution and air contamination and for the abatement, control \nand prevention of any new air pollution and air contamination, recognizing varying \nrequirements for the different areas of the Commonwealth and to submit a comprehensive \nplan to the Environmental Quality Board (EQB) for its consideration and approval; and, \nWHEREAS, the EQB promulgated regulations at 25 Pa. Code Article ill Air \nResources to implement the provisions of the Clean Air Act and to control and abate air \npollution and air contamination; and,", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-3", "section": "12", "title": "(b) of the APCA (35 P.S. §4012(b», the", "text": "WHEREAS, under Section 12(b) of the APCA (35 P.S. §4012(b», the\nadministrative procedures for the abatement, reduction, prevention and control of air \npollution set forth in the APCA shall not apply to any county ofthe first class of the \nCommonwealth which has and implements an air pollution control program that, at a \nminimum, meets the requirements of the APCA, the Clean Air Act and the rules and \nregulations promulgated under the APCA and the Clean Air Act; and,", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-4", "section": "127", "title": "706 establishes a financial assistance program for", "text": "WHEREAS 25 Pa. Code § 127. 706 establishes a financial assistance program for\nPhiladelphia County and requires submission of the Philadelphia County program to the \nDEP for review and approval; and, \nWHEREAS, Philadelphia County has developed and implemented an air quality \nprogram to meet the requirements of the Clean Air Act and the Air Pollution Control Act \nand has previously received delegation from the Environmental Protection Agency \n(hereinafter EPA) for implementation of National Emission Standards for Hazardous Air \nPollutants, New Source Performance Standards, Prevention of Significant Deterioration \nand New Source Review Programs, and has operated as a Pennsylvania approved \nprogram. \n' \n1 \n\n\nPage 18:\nNOW TIIEREFORE, the parties hereto intending to be legally bound hereby agree as \nfollows:", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-6", "section": "4012", "title": "(b».", "text": "P.S. §4012(b».\nb. Philadelphia County will implement the Philadelphia County Air Pollution \nControl Program in a manner consistent with the Program Description and \nImplementation Plan attached hereto and incorporated herein as Attachments A and B \nrespectively along with any amendments agreed to by the parties. Changes to the \nProgram Description and Implementation Plan may be made by the parties without the \nneed to amend this Agreement. \nc. Philadelphia County shall implement regulatory requirements, promulgated by \nthe Department applicable to Philadelphia County. Philadelphia County shall also \npromulgate regulations to implement regulations promulgated by the Department. \nPhiladelphia County will describe the process and timing for implementation of these \nregulations in the Annual Workload Projection prepared as required in the \nImplementation Plan. \nd. Any provision to the contrary notwithstanding, Philadelphia County shall \nassist in implementing emission trading programs adopted in 25 Pa. Code Chapter145 \n. (relating to interstate pollution transport reduction). The Department will retain \nresponsibility for allocating allowances under Chapter 145. Philadelphia County and the \nDepartment shall discuss implementation ofEP A adopted trading programs, as necessary. \ne. The requirements for notification, enforcement and program suspension or", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-7", "section": "12", "title": "(c), (d), (e) and (f) of the APCA (35 P.S. §4012(c),", "text": "rescission are contained in Section 12(c), (d), (e) and (f) of the APCA (35 P.S. §4012(c),\n(d), (e) and (f). \nf The Department shall have access to and the right to examine and copy any \npertinent books, documents, letters, reports or records related to the Philadelphia County \nProgram.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-8", "section": "127", "title": "706(b), no later than April 30 of each year,", "text": "g. Under 25 Pa. Code § 127 . 706(b), no later than April 30 of each year,\nPhiladelphia County shall submit to DEP a description of the implementation ofthe local \nair pollution control program during the current year as described in the Implementation \nPlan, including the Title V operating permit program in the county along with a detailed \naccounting of the costs of implementation. \nh. Philadelphia County will submit to DEP the information required by the \nImplementation Plan attached hereto and incorporated herein as Attachment B. \n2 \n\n\nPage 19:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-9", "section": "i", "title": "Philadelphia County will, during a period of time agreeable to both", "text": "i. Philadelphia County will, during a period of time agreeable to both\nPhiladelphia County and the Department, work with the Department to establish a \nprocedure to provide Philadelphia County's stationary point source information to the \nDepartment's Air Information Management System through the exchange of data. The \nDepartment agrees to provide training and the necessary support to Philadelphia County \nas needed. \nj. Until a Title V Operating Permits Program Implementation Agreement is \nexecuted by Philadelphia County, the Department and the U.S. Environmental \nProtection Agency, Philadelphia County agrees to implement the requirements of the \nTitle V Operating Permits Program Implementation Agreement executed by the \nDepartment and EPA applicable in the Philadelphia County area to the extent that \nPhiladelphia County is authorized to implement that agreement. \nk. Philadelphia County will register and participate in DEP training regarding \nregulations, guidance, inspection procedures or other matters relevant to the Title V \noperating permit program. \nIT. FINANCIAL ASSISTANCE \na. The Department may provide payment of a portion of the Title V emission fees \ncollected by the Department as necessary, appropriate and available to assist Philadelphia \nCounty in implementation of the Title V operating permit program in the county. \nb. The Department may withhold this financial assistance if Philadelphia County \nhas not implemented the Title V program in the manner substantially required by this \nagreement. \nc. Philadelphia County will use this financial assistance only to cover the \nreasonable direct and indirect costs of administering the operating permit program \nrequired by Title V of the Clean Air Act. \nd. Philadelphia County shall deposit all Title V fees collected by the county and \nall financial assistance provided by the Department into a restricted account established \nby Philadelphia County to implement the Title V program. All interest earned on account \nfunds shall be paid to the restricted account in a manner consistent with procedures \nestablished by the City of Philadelphia Grants Accounting Unit and attached hereto and \nincorporated herein as Attachment D. \ne. Philadelphia County agrees to designate a financial assistance officer who, on \nits behalf, shall be the primary contact with the Department for issues related to financial \nassistance during the duration ofthis Agreement. \nf Payment provisions.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-10", "section": "An Application for Available Funds (hereinafter Application)shaU be", "title": "", "text": "1. An Application for Available Funds (hereinafter Application)shaU be\nin writing on a form approved by the Department. The Application shall be received by \n3 \n\n\nPage 20:\nthe deadline established by the Department. The Application shall include a budget \noutlining anticipated expenses.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-11", "section": "The approved Application for the first agreement year is attached to", "title": "", "text": "2. The approved Application for the first agreement year is attached to\nand made a part of this agreement as Attachment C. Applications and budgets for \nsubsequent contract years shall be submitted by Philadelphia County for review and \napproval by the Department on or before March 31st without the need to amend this \nagreement.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-12", "section": "30", "title": "days of the end of each quarter except for the final quarter. Such claim wiII be", "text": "(30) days of the end of each quarter except for the final quarter. Such claim wiII be\nsubmitted no later than 100 days after the end of each agreement year. The days for \nclaims submittal are October 30, January 30, April 30, and October 8. Payment for \napproved expenditures shall be made by the Department as soon as reasonably possible. \nThe first claim for payment for the first agreement year will be for July 2010 through \nDecember 2010 and wiIl be submitted upon execution of this agreement.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-13", "section": "The Department may suspend claim processing until receipt of required", "title": "", "text": "4. The Department may suspend claim processing until receipt of required\nreports or the substantial completion of all conditions of this agreement.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-14", "section": "Philadelphia County shall have discretionary authority to spend the", "title": "", "text": "5. Philadelphia County shall have discretionary authority to spend the\nfunds made available by this Agreement for the work performed, with allowance for \ndeviation of the amounts allocated to the budget categories so long as the total budget \namount is not exceeded. However, DEP shall be informed prior to any such deviation \nand shall have the right to approve/disapprove any reallocation greater than 10% of the \ntotal annual amount in any year.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-15", "section": "Except as otherwise provided in Section n, the Department shall", "title": "", "text": "6. Except as otherwise provided in Section n, the Department shall\nprovide financial assistance to Philadelphia County in the quarterly amounts approved by \nthe Department in the budget of each annual Application.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-16", "section": "Upon request by the County, the Department may increase the financial", "title": "", "text": "7. Upon request by the County, the Department may increase the financial\nassistance for each agreement year. To be valid, any request to increase the funding for a \nagreement year must be in writing and approved by the DEP Deputy Secretary of Air, \nRecycling, and Radiation Protection, DEP Agency Attomey, and the DEP Comptroller. \nWithout the duly authorized funding increase, the DEP obligation to Philadelphia County \nshall not exceed the authorized funding previously approved according to the approved \napplication for each annual agreement period. \ng. Audit.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-17", "section": "Philadelphia County agrees to account for all Title V fees and financial", "title": "", "text": "1. Philadelphia County agrees to account for all Title V fees and financial\nassistance funds using invoices, subcontracts, time reports and employee expense reports \nand to keep separate, appropriate books and records that will establish the receipt and \nexpenditure of all Title V fees and Financial Assistance. Such records shall be retained \n4 \n\n\nPage 21:\nand made available for audit for a period of three (3) years after final payment is made \nand all pending matters are resolved.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-18", "section": "Philadelphia County shall on an annual basis submit to the Department", "title": "", "text": "2. Philadelphia County shall on an annual basis submit to the Department\na financial audit, in accordance with the \"Single Audit\" report issued by the Finance \nDepartment and performed by the County's Controller's office.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-19", "section": "The audit shall be submitted each year on the \"Single Audit\"", "title": "", "text": "3. The audit shall be submitted each year on the \"Single Audit\"\nsubmission date as required by federal regulations. \n5 \n\n\nPage 22:\nIN WITNESS WHEREOF, the parties hereto have set their hands and seals the day and year first \nabove written. \nATTESTIWITNESS: \nAPPROVED AS TO FORM \nSHELLEY R.SMITH \nCITY SOLICITOR \nPatrick K. 0 'Neill \nDivisional Deputy City Solicitor \nDate:-,-I_U-lf,-,-f+/-,,~,--O-,-(_f) __ _ \nCOMMONWEALTH OF PENNSYLVANIA \nDEPARTMENT OF ENVIRONMENTAL \nPRO \nTION \nenneth R. ReIsinger, \nlng Deputy Secretary for \naste, Air and Radiation Management \nCITY AND COUNTY OF \nPHILADELPHIA \nDEPARTMENT OF PUBLIC HEALTH \nDonald F. Sc wa z, MD, MPH \nDeputy May , ealth & Opportunity \nHealth Commissioner \nDate: pj;a \nFederal Tax Identification \nNumber: 23-6405285 \nVendor #: 07Qqo ,?~--:():-:O\"'3'--\n... \" ........•.....••..• \".2'i'~.'; .• ·\",ii.,,,f.~.,·~.:.\"\"':\"<\"\"~.\"i.·\"\":project dates: July 1, 2010 - June 30,2011 \nI hereby approve this agreement and certity that funds in the amount of \n$700,000 \nare available under Appropriation \n6600400-3522709000-3527027654-2007710000 \n\n\nPage 23:\nPHILADELPHIA DEPARTMENT OF PUBLIC HEALTH \nPUBLIC HEALTH SERVICES DIVISION \nAIR MANAGEMENT SERVICES \nATTACHMENT A \nPROGRAM DESCRIPTION", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-26", "section": "I", "title": "Program Authority and Responsibility", "text": "I. Program Authority and Responsibility\nThe Air Management Services (AMS) component of the Philadelphia Department of \nPublic Health is the local air pollution control agency for the City and County of Philadelphia, \nAMS programs are conducted under authority provided by the Philadelphia Home Rule Charter, \nPhiladelphia Code, the Pennsylvania Air Pollution Control Act, and the federal Clean Air Act. \nAMS is responsible for the prevention, abatement and control of air pollution and air pollution \nnuisances, as required to achieve and maintain federal national ambient air quality standards \n(NAAQS) within Philadelphia, AMS is also responsible for the control of airborne asbestos from \nbuilding renovation and demolition projects, and for the abatement of community noise and \nvibration nuisances,", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-27", "section": "II", "title": "Public Services", "text": "II. Public Services\nAMS services to the public include review and evaluation of plans for proposed new and \nmodified sources of air contaminant emissions; issuance of facility operating permits for \napproved sources; conducting facility compliance inspections, including source testing and the \ntaking of samples; responding to community complaints of air pollution and odors; citing \nviolations where observed; and initiating timely and appropriate enforcement actions to resolve \nviolations. AMS also operates a citywide air monitoring network that continuously samples \nPhiladelphia's air quality for compliance with federal standards, and provides daily information \non air quality to the public through the media, AMS enforces community noise and vibration \nstandards by responding to citizen complaints; conducting noise and vibration measurements; \nciting observed violations of noise and vibration standards; working with affected parties to \n1 \n\n\nPage 24:\nresolve noise and vibration problems; and initiating appropriate enforcement action as \nrequired. AMS activities to control the public's exposure to asbestos include review of \napplications and notifications for proposed asbestos abatement projects; issuance of permits for \napproved projects; conducting inspections at project work sites; responding to public inquiries \nand complaints regarding asbestos; citing violations of applicable standards and work practices; \nand taking appropriate enforcement actions. AMS also reviews license and certification \napplications for asbestos contractors, asbestos project inspectors, asbestos investigators, \nand analytical laboratories, and conducts audits at project work sites to monitor compliance \nwith the state's asbestos worker certification requirements.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-28", "section": "III", "title": "Program Organization", "text": "III. Program Organization\nOrganizationally, AMS is comprised of two central support groups, Administrative \nServices and Program Services, and two operating groups, Regulatory Services and \nTechnical Services, each reporting to the AMS Program Director. The composition and \nfunction of each organizational group is described below.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-29", "section": "IV", "title": "Program Support Services", "text": "IV. Program Support Services\nA. Administrative Services \nThe Administrative Services group is responsible for providing centralized \nadministrative and organizational support related to the development, allocation and \nmanagement of agency funding, personnel, and other program resources. Administrative \nServices provides oversight and coordination of certain decentralized administrative support \nfunctions associated with agency operating units. Areas of responsibility include \nimplementation of administrative policies and procedures; budget and revenues management; \ncontracts and grants management; facilities and fleet management; personnel management; \norganizational development and workforce planning; training coordination; and program \nactivity and service level tracking and reporting. Administrative Services also provides \nadministrative and executive support to the operation of the city's Air Pollution Control \nBoard. \nB. Program Services \nThe Program Services group is responsible for providing centralized support related \nto the development and implementation of the AMS program, to ensure that its functions \nand operations are maintained consistent with, and responsive to, needs and demands \nimposed by federal and state requirements, regional initiatives, and local government and \ncommunity concerns. A significant part of Program Services' support role involves the \nestablishment of appropriate operations management and information systems necessary \nto the effective functioning of the AMS program. Areas of responsibility include agency \nstrategic planning; inter- and intra-agency program coordination and integration; \npreparation and processing of revisions to the Philadelphia-portion of the Pennsylvania State \nImplementation Plan (SIP) for Air Quality; management of emission inventory and facility \ncompliance databases; mobile source emissions and related transportation project \n2 \n\n\nPage 25:\nassessments; air quality simulation modeling; and development and preparation of annual air \nquality reports and other agency public outreach materials. The Program Services group is \nalso responsible for maintaining and upgrading the hardware and software components of \nthe AMS local area network (LAN) computer system; identifying and prioritizing agency \ninformation system needs and related database program development; and for assuring \nadequate end-user training and support in the use of hardware and software. Program Services \nserves as a technical and informational resource to the city's Air Pollution Control Board.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-30", "section": "V", "title": "Program Operations", "text": "V. Program Operations\nA. Regulatory Services \nThe AMS Regulatory Services group is responsible for implementation and \nenforcement of all applicable local, state and federal regulatory requirements pertaining to the \nprevention and control of air pollution, asbestos contamination, and noise and vibration \nnuisances within the City of Philadelphia. The Regulatory Services group is comprised of \nthree sections: Source Registration (Permitting), Facility Compliance and Enforcement, and \nAsbestos Control.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-31", "section": "Source Registration", "title": "Source Registration is responsible for the review and approval/disapproval of", "text": "1. Source Registration\nSource Registration is responsible for the review and approval/disapproval of \napplications for installation, modification and operation of sources of air contaminant \nemissions within the City of Philadelphia. Source Registration activities include review of \napplications pertaining to: installation permits and operating licenses, as required under the \nPhiladelphia Code; plan approvals and operating permits, as required under 25 Pa. Code \nChapter 127; and Title V, Prevention of Significant Deterioration (PSD), New Source Review \n(NSR), New Source Performance Standards (NSPS) and National Emission Standards for \nHazardous Air Pollutants (NESHAP) permits, as required under the federal Clean Air Act. \nState and federal permit requirements are administered and enforced locally pursuant to state and \nfederal delegations of authority made to the City of Philadelphia. Source Registration is also \nresponsible for issuance of source or facility permit and license approval documents, as \nwell as for conducting appropriate public notification and public involvement activities as may \npertain to applications under review, including the holding of public and administrative \nhearings, and the preparation of responses to comments received from the public. To minimize \nredundancy and paperwork burdens, Source Registration attempts, wherever possible, to \nconsolidate local permit requirements with any state/federal permit requirements that may \napply to a source or facility within Philadelphia. Source Registration is also responsible for \nactivities related to the stack testing of emission units and Continuous Emission Monitoring \nSystems (CEMS). Stack testing activities include reviewing and approving test protocols, \nobserving stack tests, and reviewing stack test reports. CEMS activities include reviewing \nand approving Phase I applications for the installation of new CEMS, observing parts of the \nPhase II performance testing for new CEMS, and reviewing Phase III CEMS performance \ntest reports. Stack tests and CEMS must comply with 25 Pa. Code Chapter 139, the \nPennsylvania Source Test Manual, and the Pennsylvania Continuous Monitoring Manual as \nwell as any applicable EPA reference methods and performance specifications. \n3 \n\n\nPage 26:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-32", "section": "Facility Compliance and Enforcement", "title": "Facility Compliance and Enforcement is responsible for implementation of local, state", "text": "2. Facility Compliance and Enforcement\nFacility Compliance and Enforcement is responsible for implementation of local, state \nand federal regulatory requirements applicable to sources and facilities within Philadelphia; \nconducting compliance assurance inspections at permitted facilities; maintaining \ncitywide surveillance and responding to citizen complaints regarding air pollution, noise and \nvibration nuisances; and for pursuing appropriate enforcement actions to resolve violations, \nincluding entering into compliance agreements, filing for court-ordered consent decrees, and \nseeking injunctive actions in cases posing imminent endangerment to public health. \nThe Compliance Assurance unit, through its engineering staff, is responsible for \nmonitoring source and facility compliance with regulatory and operating permit \nrequirements; preparing documentation for issuance of formal notices of violation (NOV) for \nverified non-compliance; identifying \"significant violators\" for resolution in accordance with \nU.S. EPA's Compliance Monitoring Strategy (CMS) and guidance; performing data collection \nand validation activities for maintenance of the air emissions inventory for Philadelphia; and \nproviding appropriate information for uploading to the U.S. EPA's Air Information \nRetrieval (AIRS) facility compliance data system. Compliance evaluation techniques \nutilized include conducting facility inspections, reviewing and auditing facility compliance \ncertifications, testing of emissions and process materials, and engineering estimates and \nmaterial balances. Compliance Assurance field inspectors, working in cooperation with the \nengineering staff, assist in performing compliance inspections for minor sources, in addition to \ntheir duties related to providing citywide emissions surveillance and complaint response.' A \nfield inspector is available on a 24-hour basis, on workdays, weekends and holidays, either \non active duty, standby, or emergency response mode. In addition to investigating \ncomplaints related to air pollution, noise and vibration, field inspectors also respond to \nincidents involving possible leaking combustible gases and carbon monoxide from \nresidential heating units, as well as providing appropriate assistance to first responders and \nincident commanders in events involving toxic or hazardous materials releases or spills. \nThe Enforcement unit is responsible for coordinating all enforcement activities of the \nAMS program. Cases that are determined appropriate for enforcement action are referred \nfrom the compliance evaluation and inspectional units for further action. Activities of the unit \ninclude: NOV preparation and issuance; case development and coordination with the city's \nLaw Department; assessment of administrative penalties; negotiation of compliance \nagreements; enforcement coordination with the U.S. EPA, the Peunsylvania Department of \nEnvironmental Protection (DEP), and the city's Environmental Task Force; prosecution of \nsummary violations; and the development of enforcement protocols and procedures.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-33", "section": "Asbestos Control", "title": "The Asbestos Control unit is responsible for implementation and enforcement oflocal,", "text": "3. Asbestos Control\nThe Asbestos Control unit is responsible for implementation and enforcement oflocal, \nstate and federal requirements applicable to the control of emissions of asbestos and the \nregulation of the asbestos abatement industry. The unit, pursuant to local delegation of authority \nfrom the U.S. EPA, enforces the federal NESHAP for Asbestos at renovation and demolition \n4 \n\n\nPage 28:\norganizations, for purposes of monitoring methods development or data gathering for health \neffects studies or environmental characterizations. AMS also participates in the EPA \nperformance Evaluation Audit (Audit through-the-probe, or TTP) program run by EPA \nOffice of Air Quality Planning and Standards (OAQPS). OAQPS runs the PM2.5 \nperformance evaluation program for AMS. Air Monitoring also maintains and calibrates \nportable sampling equipment used by inspectional staff within AMS' Regulatory Services \nand also that used by the Philadelphia Fire Department in responding emergency situations.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-34", "section": "Computer Center", "title": "The Computer Center is responsible for providing data processing services for Technical", "text": "2. Computer Center\nThe Computer Center is responsible for providing data processing services for Technical \nServices' air monitoring and laboratory operations. These services include management of \nESC E-Data Acquisition System, SQL-Server, Oracle Server, File server, and twenty four \nworkstations with PCs... Computer Center personnel are responsible for hardware systems \ndesign and construction, program development and implementation, systems maintenance, \ndatabase management and reporting, and user support through infonnation distribution and \ntraining. The majority of the activities of the Computer Center are devoted to supporting the air \nquality monitoring an.d data reporting systems required by federal regulations. A gas \nchromatograph, three liquid chromatographs, and an atomic absorption spectrophotometer are \nbeing interfaced with one of the scientific computer systems in order to increase productivity \nand to ease data analysis and reporting workloads. The Computer Center also provides \npersonal computer (PC) workstations for AMS Laboratory staff for use in word-processing, \nspreadsheet, and data base applications. These PC systems are used for report writing, \nfiscal work, and general administrative functions perfonned at the AMS Laboratory.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-35", "section": "Analytical Chemistry", "title": "The Analytical Chemistry section is responsible for providing a wide range of laboratory", "text": "3. Analytical Chemistry\nThe Analytical Chemistry section is responsible for providing a wide range of laboratory \nservices, involving support to air monitoring activities and perfonnance of non-routine chemical \nanalysis projects. \nThe Calibration unit is responsible for performing required precision and accuracy \nchecks on the air monitoring instruments deployed throughout the citywide network, \nincluding maintenance and flow checks on system auto-calibration equipment and perfonnance of \nannual instrument audits using U.S. EPA-designated audit equipment. The Calibration unit \nalso performs quarterly audits on particulate monitors. Responsibilities extend to general \ntroubleshooting and maintenance of air monitoring equipment. \nThe General Chemistry unit is responsible for weighing and analysis of filter samples \nobtained from the particulate monitoring instruments within the citywide network, and for \nmaintaining all required measurement records. In addition to perfonni.l1g gravimetric analysis of \nfilters from PMl 0 and PM2.5 samplers, filters from high volume air samplers (HV AS), \ncollecting total suspended particulates (TSP), are analyzed for lead plus seven other trace metals \n(chromium, cadmium, iron, manganese, nickel, zinc, copper). The unit also perfonns qualitative \nand quantitative analyses on soils, as well as on samples obtained from special purpose \nmonitors (SPM) deployed for study purposes. The General Chemistry unit maintains \n6 \n\n\nPage 29:\ncapability for monitoring gross beta-radioactivity on TSP filters, performs measurements of \nconductivity and pH on precipitation samples collected during significant rainfall events, and \nconducts analyses of sulfur content in fuel oil samples taken to monitor compliance with the \ncity's sulfur-in-fuel regulations. The unit is also responsible for performing general \nmicroscopy work related to identification and analysis of asbestos in bulk material samples \ncollected by inspectors in the Asbestos Control unit; identification of particulate samples taken \nfrom areas impacted by soot falls, or other excessive particle deposition incidents, for \npurposes of determining possible responsible sources; and for providing pollen counts during \nthe ragweed pollen season. \nThe Air Toxics unit is responsible for collection (via sorbent tubes/canisters), preparation, \nand identification and analysis, by GC/MS, of air samples for a wide range of trace organic \npollutants. Air sampling for formaldehyde (plus six other compounds) is conducted using a \nseparate monitoring method and analysis is performed by high pressure liquid chromatography \n(HPLC). Air filters from 5 sites are sent to West Virginia for analysis of seven metals \n(Arsenic, Beryllium, Cadmium, Chromium, Lead, Manganese, and Nickel). The Air Toxics \nunit has also been involved in providing sample collection and analytical support to community \nexposure assessments and other special studies related to measuring ambient concentrations \nof certain toxic organic compounds in the vicinity of industrial or commercial sources.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-36", "section": "VI", "title": "Program Resources", "text": "VI. Program Resources\nA. Program Service Locations \nAMS Central Office: \n321 University Avenue, 2nd Floor \nPhiladelphia, PA 19104 \nTelephone (215) 685-7584 \nFax (215) 685-9451 or 685-7593 \nB. Program Budget and Staffing", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-40", "section": "7", "title": "Class 100 - Personal Services", "text": "0.7\nClass 100 - Personal Services \nClass 200 - Purchase of Services \nClass 300 - Materials and Supplies \nClass 400 - Equipment \nClass 800 - Payments to Others \n7 \nAMS Laboratory: \n1501 E. Lycoming Street \nPhiladelphia, PA 19124 \nTelephone (215) 685-1477 \nFax (215) 685-1476 \nTitle V Fees", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-44", "section": "Program Personnel:", "title": "General Fund", "text": "3. Program Personnel:\nGeneral Fund \n39 \nEPA Grants \n23 \nPAGrant \n6 \n8 \n5 Title V Fees \n2 Biowatch \nTotal \n75", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-45", "section": "900", "title": "Page 32:", "text": "6.900\n\n\nPage 32:\nIMPLEMENTATION PLAN \nATTACHMENTB \nANNUAL WORKLOAD PROJECTION \nPhiladelphia County shall submit an annual plan to the Department for review. The \nplan shall describe how the County will implement their air pollution program for the \nfollowing year and shall be submitted by Apri130 of the preceding year. For purposes of this \nagreement, the annual plan will be consistent with the Commonwealth of Pennsylvania's fiscal \nyear which begins on July 1 st and ends on June 30th unless this agreement specifically states \nthat the calendar year shall be used. The plan shall provide a workload projection for the \nfollowing year including but not limited to the number of plan approvals and operating permits to \nbe issued, the number of compliance inspections to be conducted, the number of complaints to be \ninvestigated, the number of source tests to be observed, and any other activities that would \naccount for substantial workload for the Philadelphia County staff. The plan shall also \ninclude major objectives/goals scheduled to be completed during the following year and the \nexpected completion dates. The plan shall be in a format mutually agreed upon by Philadelphia \nCounty and PADEP. \nEMISSIONS REPORTING \nPhiladelphia County shall implement an emissions reporting program as \nfollows: \nEmission Inventory \nPhiladelphia County shall maintain a computerized emission inventory for all \nfacilities that are classified as major facilities for Title V, Reasonably Available Control \nTechnology (RACT), NSR, PSD or any other categories of facilities identified by DEP. A \ncurrent list of categories for the Southeast Region is attached as Appendix 1. DEP will notify \nPhiladelphia County of any changes to the list at least 90 days prior to the next reporting \nperiod and allow Philadelphia County 60 days for review and comment. Philadelphia \nCounty shall update the inventory at the frequency specified in DEP's Rules and Regulations. \nThe inventory will have sufficient detail to determine the potential and actual emission rates", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-46", "section": "112", "title": "(b) air toxic", "text": "from each source for CO, NOx, SOx, VOC, PM lO, PM2.5 and the Section 112(b) air toxic\npollutants. The inventory shall detail actual throughput rates for each source on a monthly \nbasis unless otherwise agreed upon by DEP and Philadelphia County. \nEmission Statements \nPhiladelphia County shall require an annual emission statement from facilities which \nemit VOC or NOx. If the facility category is listed on the exemption list published at 23 Pa. \nBulletin 1994-1995, then only those facilities with an actual emission rate of 25 tons per year \nor more ofVOC or NOx need to submit a statement. The emission statement must indicate \nthe actual emission rates of VOC and NOx, the method used to calculate the emissions, and a \ncertification by a company officer or plant manager that the information is accurate. The \n10 \n\n\nPage 33:\naverage pounds per day must not be diluted by non-operational periods during the ozone season. \nThe statement shall be required by March I for the preceding calendar year. Philadelphia \nCounty shall enter the actual emissions from each facility into the computerized emission \ninventory on an annual basis. \nEMISSION REPORTING REQUIREMENTS \nPhiladelphia County shall provide the following to DEP on an annual basis using a \nmethod mutually agreed upon by both agencies:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-47", "section": "The names of all facilities which provided emission inventory and/or emission", "title": "", "text": "1. The names of all facilities which provided emission inventory and/or emission\nstatement information for the preceding calendar year.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-48", "section": "An opportunity to review the complete emission inventory/emission statement", "title": "", "text": "2. An opportunity to review the complete emission inventory/emission statement\nfor facilities identified by DEP. DEP will use AIRS to the maximum extent possible for this \npurpose. However, AMS is encouraged to use the DEP's Air Information Management System \n(AIMS) to meet this requirement. \nSOURCE MONITORING \nInspections \nPhiladelphia County shall conduct at least one Full Compliance Evaluation (FCE) \ninspection at the Class A facilities and at least one general inspection at the Class B facilities \nselected for inspection in the annual plan. Philadelphia County will conduct Stage IIII and \nNESHAP asbestos removal inspections in accordance with the annual plan. Inspection \nreports should clearly indicate the results of the inspections. Inspectors must be adequately \ntrained in inspection methods including bulk sampling techniques (asbestos, fuel oil, VOC, \netc.) and certified to read visible emissions in accordance with EPA Method 9 or other P ADEP \napproved methods. \nComplaint Handling \nPhiladelphia County shall have a system in place to record complaints and ensure \nthat they are responded to appropriately within a reasonable time frame. Inspection reports \nshould clearly indicate the results of an investigation. Philadelphia County shall notify \ncomplainants regarding the outcome of their complaints as appropriate. \nSOURCE MONITORING REPORTING REQUIREMENTS \nPhiladelphia County shall provide the following to DEP calendar quarterly, within 30 \ndays after the end of each calendar quarter, using a method mutually agreed upon by both \nagencies. For purposes of this agreement, the first calendar quarter will end on September 30th \nunless specifically stated otherwise.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-49", "section": "A list of the A and B facilities inspected during the calendar quarter. The", "title": "", "text": "1. A list of the A and B facilities inspected during the calendar quarter. The\n11 \n\n\nPage 34:\nlist shall include the company name, plant name, plant address and the date \nof the inspection.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-50", "section": "The number ofNESHAP asbestos removal notifications received and the", "title": "", "text": "3. The number ofNESHAP asbestos removal notifications received and the\nnumber ofNESHAP asbestos inspections conducted during the calendar \nquarter.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-52", "section": "An opportunity to audit inspection reports identified by DEP.", "title": "ENFORCEMENT", "text": "5. An opportunity to audit inspection reports identified by DEP.\nENFORCEMENT \nWhen non-compliance with any regulation contained in the Pennsylvania SIP is \ndocumented, Philadelphia County shall take reasonable and necessary action to achieve \ncompliance including the issuance of notices of violation and enforcement action. DEP \nrecognizes the discretionary nature of enforcement and will rely on Philadelphia County's \njudgment in determining what level of enforcement is appropriate to the maximum extent \npossible. If DEP determines that Philadelphia County is unwilling or unable to resolve a", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-53", "section": "12", "title": "of the", "text": "violation, DEP may pursue resolution ofthe violation in accordance with Section 12 of the\nPennsylvania Air Pollution Control Act. \nPhiladelphia County will provide enforcement information to EPA consistent with its \ngrant agreement with EPA for the year. DEP will make its computerized compliance system \navailable to Philadelphia County for this purpose. \nENFORCEMENT REPORTING REQllREMENTS \nPhiladelphia County shall provide the following to DEP quarterly, within 30 days after \nthe end of each calendar quarter, using a method mutually agreed upon by both agencies:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-54", "section": "A copy of any enforcement or penalty policy revised or created during the", "title": "", "text": "2. A copy of any enforcement or penalty policy revised or created during the\npreceding calendar quarter.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-55", "section": "An opportunity to conduct a detailed audit of enforcement actions identified", "title": "", "text": "3. An opportunity to conduct a detailed audit of enforcement actions identified\nbyDEP. \nAMBIENT AIR MONITORING \nPhiladelphia CoUnty shall conduct an ambient air monitoring program which meets the \nrequirements of 40 CFR Part 58 (Ambient Air Quality Surveillance). \n12 \n\n\nPage 35:\nPhiladelphia County will provide and maintain real-time access to Philadelphia County \nair monitoring database as required by DEP for access to air monitoring data and standard \nreports. \nAMBIENT AIR MONITORING REPORTING REQUIREMENTS \nPhiladelphia County shall provide the following to DEP using a method mutually agreed \nupon by both agencies:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-56", "section": "A calendar quarterly report (Quicklook Criteria Parameters AMP 450 & Data", "title": "Completeness report AMP 430), prepared on a calendar year quarterly basis, verifying", "text": "1. A calendar quarterly report (Quicklook Criteria Parameters AMP 450 & Data\nCompleteness report AMP 430), prepared on a calendar year quarterly basis, verifying \nambient air monitoring data submission to the EPA AIRS/ AQS database within 90 days after the \nend of the report calendar quarter. This report shall include a summary of the reporting sites and \ndevices, the percent data capture for each device, and the associated quality assurance statistical \nreports (precision checks and audits). Data submitted for the P AMS (enhanced ozone precursor \nmonitoring) network will not be included until notification is provided by DEP to Philadelphia \nCounty. At least 90 days notice will be provided by DEP when P AMS data is to be added to this \nrequirement.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-57", "section": "20d). Comments will be included in the annual review report submitted to EPA along with", "title": "", "text": "58.20d). Comments will be included in the annual review report submitted to EPA along with\nany air monitoring network modifications required and agreed upon by Philadelphia County and \nDEP. \n3 . Provide a copy of the ambient monitoring 5-year network assessment document that is", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-58", "section": "58.10", "title": "( d)", "text": "submitted to EPA under the requirements of 40 CFR Part 58, Subpart B, Section 58.10( d)\nstarting with the first assessment due on July 1, 2010. \nSTACK TESTING REQUIREMENTS \nEach stack test required by Philadelphia County shall meet the applicable requirements \nspecified in 25 Pa. Code Chapter 139 and the latest version ofDEP's Source Testing Manual. \nSTACK TESTING REPORTING REQUIREMENTS \nPhiladelphia County shall provide the following to the DEP quarterly, within 30 days \nafter the end of each calendar quarter, using a method mutually agreed upon by both agencies:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-60", "section": "An opportunity to review stack test information for tests identified by DEP which can", "title": "", "text": "2. An opportunity to review stack test information for tests identified by DEP which can\ninclude the test report summary, Philadelpliia County's decision regarding the acceptability \nof the test results, and Philadelphia County's observation report. \n13 \n\n\nPage 36:\nCONTINUOUS EMISSION MONITORING \nPhiladelphia County shall conduct a continuous emission monitoring program in \naccordance with 25 Pa. Code Chapter 139 unless modifications of the requirements are \napproved by DEP in writing. \nCONTINUOUS EMISSION MONITORING REPORTING REQUIREMENTS \nPhiladelphia County shall provide a list of all monitors approved at the time the \nPhiladelphia CountylDEP Implementation Agreement is signed. Philadelphia County shall \nprovide the following to DEP quarterly, within 30 days after the end of each calendar quarter, \nin a method mutually agreed upon by both agencies:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-61", "section": "An opportunity to audit the complete approval for continuous monitors identified by", "title": "DEP", "text": "3. An opportunity to audit the complete approval for continuous monitors identified by\nDEP. \nAIR QUALITY PERMITTING \nPhiladelphia County shall continue to implement an air contamination source permitting \nprogram, as approved by DEP, that is at least as stringent as the requirements of25 Pa. Code \nChapter 127. Philadelphia County's permitting program shall conform to or be more \nstringent than that ofDEP, and be implemented in accordance with DEP policies and procedures, \nunless modifications are approved by DEP in writing. \nPhiladelphia County's permitting program shall include, without limitation, the following \nprogram elements necessary to conduct reviews and approve/deny plans to construct, modi.fY and \noperate air contamination sources:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-62", "section": "Operating permits to facilities that do not otherwise meet federal permitting", "title": "", "text": "6. Operating permits to facilities that do not otherwise meet federal permitting\nrequirements but have received previous source operating permits from \nPhiladelphia County or that meet the following actual emissions criteria: \n14 \n\n\nPage 37:\nPollutant \nPTE«TPY) \nActual Emission Rate> (TPy) \nCO \n100 \n20 \nNOx \n25 \n10 \nSOx \n100 \n8 \nPMIO \n100 \n3 \nPM2.5 \n100 \n3 \nVOC \n25 \n8 \nSingle HAP \n10 \n1 \nMultiple HAPs \n25", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-63", "section": "Best Available Technology permitting requirements in accordance with DEP", "title": "", "text": "10. Best Available Technology permitting requirements in accordance with DEP\npolicies and procedures for new and newly modified sources that are not otherwise \nrequired to meet BACT or LAER as defined by EPA; and", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-64", "section": "II", "title": "Permits for construction of new sources and modification of existing sources", "text": "II. Permits for construction of new sources and modification of existing sources.\nPhiladelphia County shall participate in the regularly scheduled Title V and \nEngineering Services staff meetings. \nPhiladelphia County may use application forms of their own design, adapt or utilize the \nDepartment's forms to their use. \nPhiladelphia County may continue to require permits for sources historically covered by \nthe agency, even when those sources go beyond the criteria described in the Department's \npublished list of Plan Approval and Operating Permit Exemptions. \nWith respect to the processing of major source new source review for non-attainment \npollutants, the review shall be conducted in accordance with Chapter 127, SUbchapter E \nrequirements. Philadelphia County shall verify that emission reduction credits (ERC) from \nsources in Philadelphia County are permanent, enforceable, quantifiable and surplus. Onsite \ninspections shall be conducted to verify shutdowns. If equipment has not been dismantled or \nremoved, Philadelphia County shall annually receive certification of the continuance of the \nshutdown. Documentation sufficient for the registry and transfer of ERCs shall be provided to \nthe Division of Permits for entry in the ERC registry system. \nWith regard to Title V, Philadelphia County shall collect the emission fees prescribed in", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-65", "section": "127.705", "title": "and shall provide information needed by DEP to evaluate the adequacy of the fee", "text": "Section 127.705 and shall provide information needed by DEP to evaluate the adequacy of the fee\nrevenues and the proper use of said revenues. \n15 \n\n\nPage 38:\nTitle V operating pennits shall be issued by Philadelphia County in accordance with the", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-66", "section": "III", "title": "Title V operating permits shall", "text": "Implementation Agreement between the DEP and EPA, Region III. Title V operating permits shall\nfollow the format DEP has developed in consultation with EPA. These permits need not be \nproduced through DEP's Air Information Management System but consideration should be given \nto its eventual use. \nAIR QUALITY PERMITTING REPORTING REQUIREMENTS \nPhiladelphia County shall provide the following to DEP using a method mutually agreed \nupon by both agencies:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-67", "section": "An accounting of how Title V emission fees were used on a calendar quarterly", "title": "", "text": "5. An accounting of how Title V emission fees were used on a calendar quarterly\nbasis. This information shall be submitted within 30 days after the end of the \ncalendar quarter and submitted no later than 100 days after the end of each \nagreement year. \n16 \n\n\nPage 39:\nAPPENDIXl \nGuidance for Determining Which Facilities Belong in \nAIMS for Inventory Purposes \nThese guidelines are a synthesis ofthe inventory requirements of Title V, the Annual \nInventory, Emission Statements and other regulations that are part of the SIP. The Title V \nregulations are found in the Pennsylvania Code, Title 25, Chapter 127. The Annual", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-69", "section": "121.1", "title": "Exemptions from state operating permits can be found on page 4559 of the September", "text": "121.1. Exemptions from state operating permits can be found on page 4559 of the September\n21, 1996 Pennsylvania Bulletin. \nFacilities that wish to generate or trade Emission Reduction Credits (ERC) will need to \ndocument emissions. The annual inventory report is one way to document emissions. All \nfacilities have the option of submitting armual inventory reports for ERC purposes. If the facility \ndoes not submit armual inventory data, the facility should at least maintain sufficient production \nrecords to be able to reconstruct emissions for ERC purposes. \nThe emissions from any facility that is not required to submit armual inventory forms are \ncaptured in the area source inventory, which is calculated using demographics and emission \nfactors. For information on area source inventory, contact the Bureau of Air Quality's Air \nInformation Management Section at (717) 783-9241. \nAny emissions that are below the source reporting thresholds for facilities that are \nsubject to the annual inventory will be calculated by the Bureau of Air Quality using emission \nfactors. Facilities have the option of submitting emission estimates for emissions below the \nsource thresholds if the owner/operator of the company's estimate is better than the factor-\ngenerated numbers. \nA. Title V Facilities \nThe owners/operators of all Title V facilities must complete the annual inventory \nreporting forms. Title V facilities are subject because by definition they exceed the reporting \nthresholds in the Emission Statement and SIP regulations. Inventory information from Title V \nfacilities is used for emission fee purposes and to demonstrate compliance. \nTitle V facilities report emissions from all sources, as the sources are defined in the Title \nV permit. In some cases, the Title V permit treats multiple pieces of related equipment as one \nsource. This treatment is negotiated between the facility and DEP inventory and permit staff.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-70", "section": "0.5", "title": "tons per year of HAPs, except for the HAPs of special concemlisted below.", "text": "pollutants and 0.5 tons per year of HAPs, except for the HAPs of special concemlisted below.\nReports should round to the nearest one-hundredth of a ton. All emissions must be reported \nsource by source, not as site totals. HAPs must be reported individually (speciated). Source by \nsource speciated reporting of HAPs is required for Maximum Achievable Control Technology \n17 \n\n\nPage 40:\n(MACT) purposes. In cases where HAPs are also VOCs or particulates, do not subtract the HAP \nemission estimates from the VOC or particulate emission estimates. The subtraction will be \ndealt with by the AIMS database.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-71", "section": "2.5", "title": "MMBtu,", "text": "are of special concern. The following thresholds apply for boilers greater than 2.5 MMBtu,\nincinerators, lead handling operations, and utilities: \nPolychlorobiphenols (PCB) \nLead (Pb) \nPolycyclic Organic Matter (POM) \nDioxins \nFurans \nMercury (Hg) non-coal fired electric generating \nunits (EGU) \nMercury (Hg) coal fired EGUs \nMercury (Hg) all other types of sources \nB. Synthetic Minor Facilities", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-72", "section": "0.01", "title": "TPY per source", "text": "0.01 TPY per source\nNOx and VOC data may be required for Emission Statements and ozone calculations. \nSynthetic minor facilities may be required to complete annual inventory reporting forms when \nNOx and lor VOC emissions are generated. Facilities are subject if actual VOC emissions are \ngreater than or equal to 10 TPY for the site and lor if actual NOx emissions are greater than or", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-73", "section": "1.0", "title": "TPY or more per source must be", "text": "equal to 25 TPY for the site. Actual emissions of 1.0 TPY or more per source must be\nreported for NOx and/or VOC, whichever made the facility subject to repOlting. Reports \nshould round to the nearest one-hundredth of a ton. All emissions must be reported source by \nsource, not as site totals. \nFor example, if a facility has 12 TPY of actual VOC emissions and 20 TPY of actual NOx \nemissions, the facility must report VOCs from any source that emitted 1 TPY or more. Any \nsources that emit NOx are not required to be reported, as the facility's NO, emissions are below \nthe threshold. If the facility has 12 TPY of actual VOC emissions and 26 TPY of actual NOx \nemissions, the facility must report VOCs and NOx. \nEmission estimates for other pollutants will be calculated by DEP's AIMS database \nusing emission factors associated with source classification codes (SCC). The facility \nowner/operator has the option of reporting emission estimates for other pollutants if the \nfacility's estimates are better than the SCC-based calculations. \nSynthetic minor facilities must certify and/or demonstrate that the permit caps have not \nbeen exceeded. The certification/demonstration does not require source by source reporting of \noperating data and emission estimates using the annual inventory forms. The facility has \nthe option of completing the annual inventory forms to demonstrate compliance with the \ncaps for any pollutants. If the facility does not submit annual inventory forms, the facility \nowner/operator must arrange with Philadelphia County or DEP regional staff for an alternate \n18 \n\n\nPage 41:\ndemonstration of synthetic minor status. The regional staff will use the demonstration data to \ncalculate site total emission estimates and enter these estimates into AIMS. If an existing \npermit caps a specific source, emissions from the capped source would have to be reported \nseparately from any site totals. Electronic submission of alternate demonstration data may \nnot be possible. \nc. Natural Minor with a State Operating Permit \nNOx and VOC data may be required for Emission Statements and ozone calculations. \nThe owners/operators of natural minor facilities with operating permits may be required to \ncomplete annual inventory reporting forms when NOx and/or VOC emissions are generated. \nFacilities are subject if actual VOC emissions are greater than or equal to 10 TPY for the \nsite. Facilities are also subject if actual NOx emissions are greater than or equal to 25 TPY \nfor the site. The facility owner/operator must report only NOx and/or VOCs, whichever made", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-74", "section": "0.5", "title": "tons per year of HAPs. Reports should round to", "text": "be reported for all criteria pollutants and 0.5 tons per year of HAPs. Reports should round to\nthe nearest one-hundredth of a ton. All emissions must be reported source by source, not as \nsite totals. See the example for Synthetic Minors. Emission estimates for other pollutants \nwill be calculated by the AIMS database using SCCs. The facility has the option of reporting \nemission estimates for other pollutants if the facility's estimates are better than the \nSCC-based calculations. \nIf the facility only generates SOx, PM, CO and/or HAPs, or if the facility generates NOx \nand VOC and both are below the thresholds, the facility is not subject to the inventory. \nD. Natural Minors Exempted from State Operating Permit \nThese facilities are not required to submit annual inventory forms. The emissions from \nthese facilities are captured in the area source inventory. \n19 \n\n\nPage 43:\n \n        \n \nAPPENDIX A-3: \n \nAir Pollution Control Act of 1959 \n             \n \nBureau of Air Quality \nDepartment of Environmental Protection \n \n \n \n\n\nPage 47:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-75", "section": "4", "title": "", "text": "(4)\nstates should not be penalized for missing Clean Air \nAct deadlines when the delay is the result of the Federal \nGovernment not finalizing guidance to states on implementing \nthe act. The Commonwealth and other states must be given a \nreasonable opportunity to meet Clean Air Act deadlines. \n(2 amended July 9, 1992, P.L.460, No.95)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-76", "section": "3", "title": "Definitions", "text": "Section 3.\nDefinitions.--The following words and phrases, \nwhen used in this act, unless the context clearly indicates \notherwise, shall have the meaning ascribed to them in this \nsection: \n\"Administrator.\" \nThe Administrator of the United States \nEnvironmental Protection Agency. \n\"Air contaminant.\" \nSmoke, dust, fume, gas, odor, mist, \nradioactive substance, vapor, pollen or any combination thereof. \n\"Air contamination.\" \nThe presence in the outdoor atmosphere \nof an air contaminant which contributes to any condition of air \npollution. \n\"Air contamination source,ll \nAny place, facility or \nequipment, stationary or mobile, at, from or by reason of which \nthere is emitted into the outdoor atmosphere any air \ncontaminant. \n\"Air pollution.\" \nThe presence in the outdoor atmosphere of \nany form of contaminant, including, but not limited to, the \ndischarging from stacks, chimneys, openings, buildings, \nstructures, open fires, vehicles, processes or any other source \nof any smoke, soot, fly ash, dust, cinders, dirt, noxious or \nobnoxious acids, fumes, oxides, gases, vapors, odors, toxic, \nhazardous or radioactive substances, waste or any other matter \nin such place, manner or concentration inimical or which may \nbe inimical to the public health, safety or welfare or which \nis or may be injurious to human, plant or animal life or to \nproperty or which unreasonably interferes with the comfortable \nenjoyment of life or property. \n\"Approved air pollution control agency.\" \nAn air pollution \ncontrol agency of any political subdivision of the Commonwealth \nwhich has been granted approval by the Environmental Quality \nBoard. \n!'Board\" or 'IEQB.\" \n\"Clean Air Act.'! \n7401 et seq. \nThe Environmental Quality Board. \nPublic Law 95-95 as amended, 42 U.S.C. § \n\"Department.\" \nthe Commonwealth. \nThe Department of Environmental Resources of \n\"Environmental Protection Agency\" or \"EPA.\" \nThe United \nStates Environmental Protection Agency or the Administrator of \nthe United States Environmental Protection Agency. \n\"Gasoline-dispensing facility.\" \nA facility from which \ngasoline is transferred to motor vehicle fuel tanks. \n\"Hearing board.\" \nThe Environmental Hearing Board. \n\"Person.\" \nAny individual, public or private corporation for \nprofit or not for profit, association, partnership, firm, trust, \nestate, department, board, bureau or agency of the Commonwealth \nor the Federal Government, political subdivision, municipality, \ndistrict, authority or any other legal entity whatsoever which \nis recognized by law as the subject of rights and duties. \n\"Plan approval.\" \nThe written approval from the Department \nof Environmental Resources which authorizes a person to \nconstruct, assemble, install or modify any stationary air \ncontamination source or install thereon any air pollution \ncontrol equipment or device. \n\"Region.\" \nAny geographical subdivision of the Commonwealth \nwhose boundaries shall be determined by the Environmental \nQuality Board. \n\n\nPage 48:\n\"Small business stationary source.\" \nA stationary source \nthat:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-81", "section": "5", "title": "Compiler's Note:", "text": "(5)\nemits less than seventy-five (75) tons per year of all \nregulated pollutants. \n\"State implementation plan.\" \nThe plan or plan revision that \na state is authorized and required to submit under section 110 \nof the Clean Air Act (Public Law 95-95 as amended, 42 U.S.C. § \n7410) to provide for attainment of the national ambient air \nquality standards. \n\"Stationary air contamination source.\" Any air contamination \nsource other than that which, when operated, moves in a given \ndirection under its own power. \n(3 amended July 9, 1992, P.L.460, No.95) \nCompiler's Note: \nThe Department of Environmental Resources, \nreferred to in the def. of \"department,\" was abolished \nby Act 18 of 1995. Its functions were transferred to the \nDepartment of Conservation and Natural Resources and the \nDepartment of Environmental Protection. \nsection 4. \nPowers and Duties of the Department of \nEnvironmental Protection.--The department shall have power and \nits duty shall be to--(Hdg. amended July 5, 2012, P.L.1109, \nNo.135)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-83", "section": "2", "title": "Enter any building, property, premises or place and", "text": "(2)\nEnter any building, property, premises or place and \ninspect any air contamination source for the purpose of \ninvestigating an actual or a suspected source of air pollution \nor for the purpose of ascertaining the compliance or \nnon-compliance with this act, any rule or regulation promulgated \nunder this act or any plan approval, permit or order of the \ndepartment. In connection wi th such inspection or investigation, \nsamples of air, air contaminants, fuel, process material or \nother matter may be taken for analysis, a duplicate of the \nanalytical report shall be furnished promptly to the person who \nis suspected of causing such air pollution or air contamination.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-84", "section": "3", "title": "Have access to, and require the production of, books,", "text": "(3)\nHave access to, and require the production of, books, \npapers and records, including, but not limited to, computerized \ninformation in a format as the department may reasonably \nprescribe pertinent to any matter under investigation.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-85", "section": "4", "title": "Require the owner or operator of any air contamination", "text": "(4)\nRequire the owner or operator of any air contamination \nsource to establish and maintain such records and make such \nreports and furnish such information, including computerized \ninformation in a format as the department may reasonably \nprescribe.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-86", "section": "5", "title": "Require the owner or operator of any air contamination", "text": "(5)\nRequire the owner or operator of any air contamination \nsource to install, use and maintain such air contaminant \nmoni to ring equipment or methods as the department may reasonably \nprescribe.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-87", "section": "6", "title": "Require the owner or operator of any air contamination", "text": "(6)\nRequire the owner or operator of any air contamination \nsource to sample the emissions thereof in accordance with such \nmethods and procedures and at such locations and intervals of \ntime as the department may reasonably prescribe and to provide \nthe department with the results thereof. \n\n\nPage 49:", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-88", "section": "7", "title": "Enter upon any property on which an air contamination", "text": "(7)\nEnter upon any property on which an air contamination \nsource may be located and make such tests upon the source as \nare necessary to determine whether the air contaminants being \nemitted from such air contamination source are being emitted \nat a rate in excess of a rate provided for by this act, any \nrule or regulations promulgated under this act or any plan \napproval, permit or order of the department or otherwise causing \nair pollution. Whenever the department determines that a source \ntest is necessary, it shall give reasonable written or oral \nnotice to the person owning, operating, or otherwise in control \nof such source, that the department will conduct a test on such \nsource. Thereafter, the person to whom such notice is given \nshall provide such reasonably safe access to the testing area, \nand such sampling ports, facilities, electrical power and water \nas the department shall specify in its notice.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-89", "section": "8", "title": "Receive, initiate and investigate complaints, institute", "text": "(8)\nReceive, initiate and investigate complaints, institute \nand conduct surveys and testing programs, conduct general \natmospheric sampling programs, make observations of conditions \nwhich mayor do cause air pollution, make tests or other \ndeterminations at air contamination sources, and assess the \ndegree of abatement required.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-90", "section": "", "title": "", "text": "(i)\nIssue orders to any person owning or operating an \nair contamination source, or owning or possessing land on which \nsuch source is located, if such source is introducing or is \nlikely to introduce air contaminants into the outdoor atmosphere \nin excess of any rate provided for by this act, any rule or \nregulation promulgated under this act or any plan approval or \npermit applicable to such source, or at such a level so as to \ncause air pollution. Any such order may require the cessation \nof any operation or activity which is introducing air \ncontaminants into the outdoor atmosphere so as to cause air \npollution, the reduction of emissions from such air \ncontamination source, modification or repair of such source or \nair pollution control device or equipment or certain operating \nand maintenance procedures with respect to such source or air \npollution control device or equipment, institution of a \nreasonable process change, installation of air pollution control \ndevices or equipment, or any or all of said requirements as the \ndepartment deems necessary. Such orders may specify a time for \ncompliance, require submission of a proposed plan for \ncompliance, and require submission of periodic reports \nconcerning compliance. If a time for compliance is given, the \ndepartment may, in its discretion, require the posting of a \nbond in the amount of twice the money to be expended in reaching \ncompliance.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-91", "section": "", "title": "", "text": "(ii)\nAll department orders shall be in writing, contain \ntherein a statement of the reasons for their issuance, and be \nserved either personally or by certified mail. Within thirty", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-92", "section": "30", "title": "days after service of any such order the person to whom", "text": "(30) days after service of any such order the person to whom\nthe order is issued or any other person aggrieved by such order \nmay file with the hearing board an appeal setting forth with \nparticularity the grounds relied upon. An appeal to the hearing \nboard of the department's order shall not act as a supersedeas: \nProvided, however, That upon application and for cause shown, \nthe hearing board may issue such a supersedeas.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-93", "section": "10", "title": "Institute, in a court of competent jurisdiction,", "text": "(10)\nInstitute, in a court of competent jurisdiction, \nproceedings to compel compliance with this act, any rule or \nregulation promulgated under this act or any plan approval, \npermit or order of the department.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-96", "section": "13", "title": "Recommend the minimum job qualifications of personnel", "text": "(13)\nRecommend the minimum job qualifications of personnel \nemployed by county and municipal air pollution control agencies \nhereafter created.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-97", "section": "14", "title": "Require the submission of, and consider for approval,", "text": "(14)\nRequire the submission of, and consider for approval, \nplans and specifications of air pollution control equipment, \ndevices or process changes, and inspect such installations or \nmodifications to insure compliance with the plans which have \nbeen approved.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-98", "section": "15", "title": "Conduct or cause to be conducted studies and research", "text": "(15)\nConduct or cause to be conducted studies and research \nwith respect to air contaminants, their nature, causes and \neffects, and with respect to the control, prevention, abatement \nand reduction of air pollution and air contamination.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-99", "section": "16", "title": "Evaluate motor vehicle emission control programs,", "text": "(16)\nEvaluate motor vehicle emission control programs, \nincluding vehicle emission standards, clean alternative fuels, \noxygenated fuels, reformulated fuels, vehicle miles of travel, \ncongestion levels, transportation control measures and other \ntransportation control strategies with respect to their effect \nupon air pollution and determine the need for modifications of \nsuch programs.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-100", "section": "17", "title": "Determine by means of field studies and sampling the", "text": "(17)\nDetermine by means of field studies and sampling the \ndegree of air pollution existing in any part of the \nCommonwealth.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-101", "section": "18", "title": "Prepare and develop a general comprehensive plan for", "text": "(18)\nPrepare and develop a general comprehensive plan for \nthe control and abatement of existing air pollution and air \ncontamination and for the abatement, control and prevention of \nany new air pollution and air contamination, recognizing varying \nrequirements for the different areas of the Commonwealth, and \nto submit a comprehensive plan to the board for its \nconsideration and approval. \n(18.1) \nWithin sixty (60) days of the effective date of this \nclause, initiate a review and reevaluation of the State \nimplementation plan. The review shall include alternative \nmechanisms to 25 Pa. Code Ch. 126 Subch. C (relating to gasoline \nvolatility requirements) which will ensure compliance with this \nact. The following shall apply to the review:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-102", "section": "", "title": "", "text": "(i)\nThe department shall conduct meetings to consult with \nimpacted organizations or entities, including gasoline refining \nand distribution companies, gasoline retailers, pipeline owners, \nimpacted businesses, public utilities, local governments and \nother interested entities.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-103", "section": "", "title": "", "text": "(ii)\nWithin three (3) months of the effective date of this \nclause, the department shall provide updates to the chair and \nminority chair of the Environmental Resources and Energy \nCommittee of the Senate and the chair and minority chair of the \nEnvironmental Resources and Energy Committee of the House of \nRepresentatives. The department shall, on a regular basis, \nprovide updates to the committees. \n((18.1) added July 5, 2012, P.L.1109, No.135) \n(18.2) \nIf a supply disruption occurs, the Governor shall \nsubmit a request to the Environmental Protection Agency to waive \nthe requirements. As used in this clause, a \"supply disruption \noccurs· when either of the following subclauses apply:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-106", "section": "19", "title": "Encourage the formulation and execution of plans in", "text": "(19)\nEncourage the formulation and execution of plans in \nconjunction with air pollution control agencies or civil \nassociations of counties, cities, boroughs, towns and townships \nof the Commonwealth wherein any sources of air pollution or air \ncontamination may be located, and enlist the cooperation of \nthose who may be in control of such sources for the control, \nprevention and abatement of such air pollution and air \ncontamination.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-107", "section": "20", "title": "Encourage voluntary efforts and cooperation by all", "text": "(20)\nEncourage voluntary efforts and cooperation by all \npersons concerned in controlling, preventing, abating and \nreducing air pollution and air contamination.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-108", "section": "21", "title": "Conduct and supervise educational programs with respect", "text": "(21)\nConduct and supervise educational programs with respect \nto the control, prevention, abatement and reduction of air \npollution and air contamination, including the preparation and \ndistribution of information relating to the means of controlling \nand preventing such air pollution and air contamination.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-109", "section": "22", "title": "Develop and conduct in cooperation with local", "text": "(22)\nDevelop and conduct in cooperation with local \ncommunities demonstration programs relating to air contaminants, \nair pollution and air contamination and the control, prevention, \nabatement and reduction of air pollution and air contamination.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-110", "section": "23", "title": "Provide advisory technical consultative services to", "text": "(23)\nProvide advisory technical consultative services to \nlocal communities for the control, prevention, abatement and \nreduction of air pollution and air contamination.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-111", "section": "24", "title": "Cooperate with the appropriate agencies of the United", "text": "(24) Cooperate with the appropriate agencies of the United\nStates or of other states or any interstate agencies with \nrespect to the control, prevention, abatement and reduction of \nair pollution, and where appropriate formulate interstate air \npollution control compacts or agreements for the submission \nthereof to the General Assembly.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-112", "section": "25", "title": "Serve as the agency of the Commonwealth for the receipt", "text": "(25) Serve as the agency of the Commonwealth for the receipt\nof moneys from the Federal government or other public or private \nagencies, and expend such moneys for studies and research with \nrespect to air contaminants, air pollution and the control, \nprevention, abatement and reduction of air pollution.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-113", "section": "26", "title": "Develop and submit to the Environmental Protection", "text": "(26)\nDevelop and submit to the Environmental Protection \nAgency a procedure to implement and enforce the regulations \nwhich the Environmental Protection Agency adopts under section", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-114", "section": "183(e)", "title": "of the Clean Air Act to reduce emissions from consumer", "text": "183(e) of the Clean Air Act to reduce emissions from consumer\nand commercial products, provided the department will receive \ncredits for the reductions attributed to the Federal consumer \nand commercial products regulations under section 182 of the \nClean Air Act regulations, and the department has the resources \nto implement and enforce the program.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-115", "section": "27", "title": "Do any and all other acts and things not inconsistent", "text": "(27)\nDo any and all other acts and things not inconsistent \nwith any provision of this act, which it may deem necessary or \nproper for the effective enforcement of this act and the rules \nor regulations promulgated under this act. \n(4 amended July 9, 1992, P.L.460, No.95) \nCompiler's Note: \nThe Department of Environmental Resources, \nreferred to in this section, was abolished by Act 18 of", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-116", "section": "Its functions were transferred to the Department", "title": "", "text": "1995. Its functions were transferred to the Department\nof Conservation and Natural Resources and the Department \nof Environmental Protection.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-117", "section": "4.1", "title": "Prohibited", "text": "Section 4.1.\nProhibited.--(a) Agricultural Regulations \nExcept as may be required by the Clean Air \nAct or the regulations promulgated under the Clean Air Act, \n\n\nPage 52:\nthis act shall not apply to the production of agricultural \ncommodities and the Environmental Quality Board shall not have \nthe power nor the authority to adopt rules and regulations \nrelating to air contaminants and air pollution arising from the \nproduction of agricultural commodities. \n(b) \nAs used in this section, the term \"production of \nagricul tural commodities\" shall include, but is not limited to:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-118", "section": "1", "title": "The commercial propagation, production, harvesting or", "text": "(1)\nThe commercial propagation, production, harvesting or \ndrying on the premises of the farm operation or the disposal \nof residual materials resulting from the commercial propagation, \nproduction, harvesting or drying on the premises of the farm \noperation of the following:", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-126", "section": "2", "title": "The processing of agricultural commodities propagated,", "text": "(2)\nThe processing of agricultural commodities propagated, \nproduced, harvested or dried under clause (1) or the disposal \nof residual materials resulting from such processing.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-127", "section": "3", "title": "The commercial production, processing or storage of", "text": "(3)\nThe commercial production, processing or storage of \ncompost, except for compost including, all or in part, biosolids \noriginating at a municipal sewage treatment facility, to be \npredominantly used in the commercial propagation or production \nof any agricultural commodity identified under clause (1), \nregardless of whether the compost is being produced, processed \nor stored on a different premises than the premises in which \nthe compost is being used.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-128", "section": "4", "title": "The use of any material whose production, processing", "text": "(4)\nThe use of any material whose production, processing \nor storage is exempt from this act under clause (3) in the \ncommercial propagation or production of any agricultural \ncommodity identified under clause (1), or any odor or malodor \nor fugitive air emission resulting from the production, \nprocessing or storage of any material so exempted. \n(c) \nThe exemptions applied under SUbsection (b) (2) shall \nonly apply to agricultural commodities propagated, produced, \nharvested or dried on the premises of the farm operation.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-130", "section": "2", "title": "of Act 174 of 1996, which amended", "text": "Section 2 of Act 174 of 1996, which amended\nsection 4.1, provided that Act 174 shall be retroactively \napplied to January 1, 1991, in dismissing any pending \nlegal or administrative action by the Department of \nEnvironmental Protection arising from any activity which, \nby enactment of Act 174, is not subject to the provisions \nof Act 787.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-131", "section": "4.2", "title": "Permissible Actions", "text": "Section 4.2.\nPermissible Actions.--(a) \nIn implementing the \nrequirements of section 109 of the Clean Air Act, the board may \nadopt, by regulation, only those control measures or other \nrequirements which are reasonably required, in accordance with \nthe Clean Air Act deadlines, to achieve and maintain the ambient \nair quality standards or to satisfy related Clean Air Act \nrequirements, unless otherwise specifically authorized or \n\n\nPage 53:\nrequired by this act or specifically required by the Clean Air \nAct. \n(b) \nControl measures or other requirements adopted under \nsubsection (a) of this section shall be no more stringent than \nthose required by the Clean Air Act unless authorized or \nrequired by this act or specifically required by the Clean Air \nAct. This requirement shall not apply if the board determines \nthat it is reasonably necessary for a control measure or other \nrequirement to exceed minimum Clean Air Act requirements in \norder for the Commonwealth:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-135", "section": "4", "title": "To comply with a final decree of a Federal court", "text": "(4)\nTo comply with a final decree of a Federal court. \n(c) \nThe board may not by regulation adopt an ambient air \nquality standard for a specific pollutant which is more \nstringent than the air quality standard which the EPA has \nadopted for the specific pollutant pursuant to section 109 of \nthe Clean Air Act. \n(d) \nIn any challenge to the enforcement of regulations \nadopted to achieve and maintain the ambient air quality \nstandards or to satisfy related Clean Air Act requirements, the \nperson challenging the regUlation shall have the burden to \ndemonstrate that the control measure or other requirement or \nthe stringency of the control measure or requirement is not \nreasonably required to achieve or maintain the standard or to \nsatisfy related Clean Air Act requirements. \n(e) \nNo person may file a preenforcement review challenge \nunder this section based in any manner upon the standards set \nforth in subsection (b) of this section. \n(f) \nThis section shall not apply to rules and regUlations \napproved as a final rulemaking by the board prior to the \neffective date of this section or to any ambient air quality \nstandards adopted by the board where no such standard has been \nadopted by the EPA. \n(g) \nThis section shall not be construed to weaken or \notherwise affect site-specific standards or other requirements \nfor individual sources or facilities in place prior to the \neffective date of this section.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-136", "section": "4.3", "title": "Evaluation", "text": "Section 4.3.\nEvaluation.--Beginning five (5) years after \nthe effective date of this section and every five (5) years \nthereafter, the department shall conduct and submit to the \nGeneral Assembly an evaluation of the effectiveness of the \nprograms adopted to implement the Clean Air Act. The evaluation \nshall include:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-138", "section": "4.2", "title": "has hindered in any way the Commonwealth's efforts", "text": "section 4.2 has hindered in any way the Commonwealth's efforts\nto comply with the Clean Air Act and a recommendation on whether \nthat provision should be changed.", "requirement_type": "recommended", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-139", "section": "2", "title": "The specific steps taken to implement the Clean Air Act", "text": "(2)\nThe specific steps taken to implement the Clean Air Act \nand progress made toward meeting the emission reductions \nrequired by the act and recommendations on any additional steps \nwhich must be taken.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-140", "section": "3", "title": "An evaluation of the funding available to implement the", "text": "(3)\nAn evaluation of the funding available to implement the \nClean Air Act programs and whether that funding is sufficient \nor inadequate and recommendations on where adjustments should \nbe made.", "requirement_type": "recommended", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-141", "section": "4", "title": "An analysis of the costs imposed on mobile and", "text": "(4)\nAn analysis of the costs imposed on mobile and \nstationary air contamination sources to implement the \n\n\nPage 54:\nrequirements of the Clean Air Act, including on individuals and \ncompanies. The analysis of costs shall also consider the \nbenefits of compliance with the Clean Air Act requirements and \nthe public health, environmental and economic costs to the \nCommonwealth for failing to meet the requirements, including \nthe impact of sanctions.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-142", "section": "5", "title": "An evaluation, in consultation with the Department of", "text": "(5)\nAn evaluation, in consultation with the Department of \nCommerce and the Office of Small Business Ombudsman, of the \nadequacy of measures taken by the Commonwealth to assist small \nbusinesses in complying with the Clean Air Act.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-143", "section": "6", "title": "A summary of the activities undertaken by the Citizens", "text": "(6)\nA summary of the activities undertaken by the Citizens \nAdvisory Council and the air technical advisory committee under", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-144", "section": "7", "title": "An evaluation of the effectiveness of the Northeast", "text": "(7)\nAn evaluation of the effectiveness of the Northeast \nOzone Transport Commission in meeting the mandates of the Clean \nAir Act and recommendations on any changes that could make the \ncommission more effective.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-146", "section": "7.12", "title": "has had or will have on the State", "text": "identified under section 7.12 has had or will have on the State\nimplementation of the Clean Air Act programs.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-147", "section": "4.3", "title": "added July 9, 1992, P.L.460, No.95)", "text": "(4.3 added July 9, 1992, P.L.460, No.95)\nCompiler's Note: \nThe Department of Commerce, referred to \nin clause (5), was renamed the Department of Community \nand Economic Development by Act 58 of 1996.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-148", "section": "5", "title": "Environmental Quality Board", "text": "Section 5.\nEnvironmental Quality Board.--(a) \nThe board \nshall have the power and its duty shall be to--", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-149", "section": "1", "title": "Adopt rules and regulations, for the prevention,", "text": "(1)\nAdopt rules and regulations, for the prevention, \ncontrol, reduction and abatement of air pollution, applicable \nthroughout the Commonwealth or to such parts or regions or \nsubregions thereof specifically designated in such regulation \nwhich shall be applicable to all air contamination sources \nregardless of whether such source is required to be under permit \nby this act. Such rules and regulations may establish maximum \nallowable emission rates of air contaminants from such sources, \nprohibit or regulate the combustion of certain fuels, prohibit \nor regulate open burning, prohibit or regulate any process or \nsource or class of processes or sources, require the \ninstallation of specified control devices or equipment, or \ndesignate the control efficiency of air pollution control \ndevices or equipment required in specific processes or sources \nor classes of processes or sources. Such rules and regulations \nshall be adopted pursuant to the provisions of the act of July \n31, 1968 (P.L.769), known as the \"Commonwealth Documents Law,\" \nupon such notice and after such public hearings as the board \ndeems appropriate. In exercising its authority to adopt rules \nand regulations, the board may, and to the extent deemed \ndesirable by it shall, consult with a council of technical \nadvisers, properly qualified by education or experience in air \npollution matters, appointed by the board and to serve at the \npleasure of the board, to consist of such number of advisers \nas the board may appoint, but such technical advisers shall \nreceive no compensation, other than their actual and necessary \nexpenses, for their services to the board.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-150", "section": "2", "title": "Establish and publish maximum quantities of air", "text": "(2)\nEstablish and publish maximum quantities of air \ncontaminants that may be permitted under various conditions at \nthe point of use from any air contaminant source in various \nareas of the Commonwealth so as to control air pollution.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-151", "section": "3", "title": "By rule or regulation, classify air contaminant sources,", "text": "(3)\nBy rule or regulation, classify air contaminant sources, \naccording to levels and types of emissions and other \ncharacteristics which relate to air pollution. Classifications \nmade pursuant to this subsection shall apply to the entire \n\n\nPage 55:\nCommonwealth or any part thereof. Any person who owns or \noperates an air contaminant source of any class to which the \nrules and regulations of the board under this subsection apply, \nshall make reports containing information as may be required \nby the board concerning location, size and height of air \ncontaminant outlets, processes employed, fuels used and the \nnature and time periods or duration of emissions, and such other \ninformation as is relevant to air pollution and available or \nreasonably capable of being assembled.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-152", "section": "4", "title": "Recommend to the Secretary of Transportation performance", "text": "(4)\nRecommend to the Secretary of Transportation performance \nor specification standards, or both, for emission control \nsystems and devices on motor vehicles.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-153", "section": "5", "title": "Adopt rules and regulations for the protection of public", "text": "(5)\nAdopt rules and regulations for the protection of public \nhealth and safety for periods when the accumulation of air \ncontaminants in any area is attaining or has attained levels \nwhich, if sustained or exceeded, could lead to an acute threat \nto the health of the pUblic. Such rules and regulations shall \ncontain appropriate procedures to protect public health and \nsafety during such periods.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-154", "section": "6", "title": "Adopt rules and regulations for the approval and the", "text": "(6)\nAdopt rules and regulations for the approval and the \nrecision and suspension of approval of local air pollution \ncontrol agencies.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-155", "section": "7", "title": "Adopt rules and regulations designed to reduce emissions", "text": "(7)\nAdopt rules and regulations designed to reduce emissions \nfrom motor vehicles, including centrally clean-fueled fleets, \nclean alternative fuels, oxygenated fuels, reformulated fuels, \nvehicle miles of travel, transportation control measures and \nother transportation control strategies. Such rules and \nregulations shall be developed in consultation with the \nDepartment of Transportation. The board shall not adopt \nregulations mandating the sale or use of any set of \nspecifications for motor fuel prescribed by the State of", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-156", "section": "7545", "title": "(c) (4) (B) unless the set of", "text": "California under 42 U.S.C. § 7545(c) (4) (B) unless the set of\nspecifications is required under the Clean Air Act or the \nregulations promulgated thereunder.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-157", "section": "8", "title": "Adopt rules and regulations to implement the provisions", "text": "(8)\nAdopt rules and regulations to implement the provisions \nof the Clean Air Act. The rules and regulations adopted to \nimplement the provisions of the Clean Air Act shall be \nconsistent with the requirements of the Clean Air Act and the \nregulations adopted thereunder.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-158", "section": "9", "title": "Adopt rules and regulations to exempt sources or", "text": "(9)\nAdopt rules and regulations to exempt sources or \ncategories of sources of minor significance from the provisions", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-159", "section": "10", "title": "Adopt rules and regulations establishing provisions", "text": "(10)\nAdopt rules and regulations establishing provisions \nto allow changes within a permitted facility or one operating", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-160", "section": "6.1", "title": "without", "text": "pursuant to clause (3) of subsection (b) of section 6.1 without\nrequiring a permit revision if the changes are not modifications \nunder any provision of 42 U.S.C. Ch. 85 Subch. I (relating to \nprograms and activities) and the changes do not exceed the \nemissions allowable under the permit whether expressed therein \nas a rate of emissions or in terms of total emissions, provided \nthat the facility provides the department and the administrator \nwith written notification in advance of the proposed changes \nwhich shall be a minimum of seven (7) days, unless the board \nprovides in its regulations a different time frame for \nemergencies.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-161", "section": "11", "title": "In its discretion, by regulation require revisions to", "text": "(11)\nIn its discretion, by regulation require revisions to \npermits for major sources to incorporate applicable standards \nand regulations promulgated pursuant to the Clean Air Act and \nadopted by the board after the issuance of such permit as", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-162", "section": "12", "title": "In its discretion, by regulation adopt rules containing", "text": "(12)\nIn its discretion, by regulation adopt rules containing \nreasonable procedures consistent with the need for expeditious \n\n\nPage 56:\naction by the department on plan approvals and operating permit \napplications to make available to the public any plan approval \nor operating permit application, compliance plan, plan approval, \noperating permit and moni toring or compliance report as required", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-163", "section": "13", "title": "Adopt by regulation alternative volatile organic", "text": "(13)\nAdopt by regulation alternative volatile organic \ncompound emission limitations for aerospace coatings and \nsolvents, including extreme performance coatings, which are \nrequired to be used by the United States Department of Defense, \nthe United States Department of Transportation and the National \nAeronautic and Space Administration or to meet military and \naerospace specifications, provided such alternative limitations \nare authorized by the Clean Air Act. \n(b) \nIn adopting regulations containing transportation \ncontrol measures, the board shall not have the authority to \nadopt any regulation limiting or expanding any municipalities' \nauthority under the Municipal Planning Code to regulate land \ndevelopment, subdivision approval, zoning revision, building \npermit or any other development activity unless specifically \nrequired by the Clean Air Act. \n(5 amended July 9, 1992, P.L.460, No.95)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-164", "section": "6", "title": "Environmental Hearing Board", "text": "Section 6.\nEnvironmental Hearing Board.--The hearing board \nshall have the power and its duty shall be to hear and determine \nall appeals from appealable actions of the department as defined \nin the act of July 13, 1988 (P.L.530, No.94), known as the \n\"Environmental Hearing Board Act,\" in accordance with the \nprovisions of this act. Any and all action taken by the hearing \nboard with reference to any such appeal shall be in the form \nof an adjudication, and all such action shall be subject to the \nprovisions of 2 Pa. C. s. (relating to administrative law and \nprocedure) . \n(6 amended July 9, 1992, P.L.460, No.95)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-165", "section": "", "title": "", "text": "section 6.1.\nPlan Approvals and Permits.--(a) \nNo person \nshall construct, assemble, install or modify any stationary air \ncontamination source, or install thereon any air pollution \ncontrol equipment or device unless such person has applied to \nand received written plan approval from the department to do \nso: Provided, however, That no such written approval shall be \nnecessary with respect to normal routine maintenance operations, \nnor to any such source, equipment or device used solely for the \nsupplying of heat or hot water to one structure intended as a \none-family or two-family dwelling, nor where construction, \nassembly, installation or modification is specifically \nauthorized by the rules or regulations of the department to be \nconducted without written approval. All applications for \napproval shall be made in writing and shall be on such forms \nand contain such information as the department shall prescribe \nand shall have appended thereto detailed plans and \nspecifications related to the proposed installation. \n(b)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-166", "section": "1", "title": "No person shall operate any stationary air", "text": "(1)\nNo person shall operate any stationary air \ncontamination source unless the department shall have issued \nto such person a permit to operate such source under the \nprovisions of this section in response to a written application \nfor a permit submitted on forms and containing such information \nas the department may prescribe or where construction, assembly, \ninstallation modification is specifically authorized by the \nrules or regulations of the department to be conducted without \nwritten approval. The department shall provide public notice \nand the right to comment on all permits prior to issuance or \ndenial and may hold public hearings concerning any permit.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-167", "section": "2", "title": "A permit may be issued after the effective date of this", "text": "(2)\nA permit may be issued after the effective date of this \namendment to any applicant for a stationary air contamination \n\n\nPage 57:\nsource requiring construction, assembly, installation or \nmodification where the requirements of subsection (a) of this \nsection have been met and there has been performed upon such \nsource a test operation or evaluation which shall satisfy the \ndepartment that the air contamination source will not discharge \ninto the outdoor atmosphere any air contaminants at a rate in \nexcess of that permitted by applicable regulation of the board, \nor in violation of any performance or emission standard or other \nrequirement established by the Environmental Protection Agency \nor the department for such source, and which will not cause air \npollution.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-169", "section": "6.3", "title": "of this", "text": "without a permit for which fees required by section 6.3 of this\nact or the regulations promulgated under this act have been \npaid is authorized to continue to operate without a permit until \none hundred twenty (120) days after the department provides \nnotice to the source that a permit is required or until November \n1, 1996, whichever occurs first. If the applicant submits a \ncomplete permit application within the time frames in this \nsubsection and the department fails to issue a permit through \nno fault of the applicant, the source may continue to operate", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-170", "section": "6.3", "title": "or the regulations", "text": "if the fees required by section 6.3 or the regulations\npromulgated under this act have been paid and the source is \noperated in conformance with this act, the Clean Air Act and \nthe regulations promulgated under both this act and the Clean \nAir Act. For any performance or emission standard or other \nrequirement established by the Environmental Protection Agency \nor the department for the source subsequent to the effective \ndate of this act but prior to the permit issuance date, the \npermit may contain a compliance schedule authorizing the source \nto operate out of compliance and requiring the source to achieve \ncompliance as soon as possible but no later than the time \nrequired by this act, the Clean Air Act or the regulations \npromulgated under either this act or the Clean Air Act. For \npurposes of this subsection, a source is operating lawfully \nwithout a permit where it is a source for which no permit was \npreviously required and the source is operating in compliance \nwith applicable regulatory requirements.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-171", "section": "4", "title": "For repermitting of any stationary air contamination", "text": "(4)\nFor repermitting of any stationary air contamination \nsource which is operating under a valid permit on the effective \ndate of this act or which has received a permit under the \nprovisions of clauses (2) and (3) of this subsection and which \nis required to meet performance or emission standards or other \nrequirements established subsequent to the issuance of the \nexisting permit, the new permit may contain a compliance \nschedule authorizing the source to operate out of compliance \nand requiring the source to achieve compliance as soon as \npossible but no later than the time required by this act, the \nClean Air Act or the regulations promulgated under either this \nact or the Clean Air Act. \n(b.l) \nA permit or plan approval issued hereunder may contain \nsuch terms and conditions as the department deems necessary to \nassure the proper operation of the source. The board shall by \nregulation establish a permit shield for permits issued under \nthe authority delegated to the Commonwealth by the EPA under \nTitle V of the Clean Air Act. The program shall be consistent", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-172", "section": "504(f)", "title": "of the Clean Air Act", "text": "with the requirements of section 504(f) of the Clean Air Act\nand the regulations promulgated thereunder. Each permittee, on \na schedule established by the department, shall submit reports \nto the department containing such information as the department \nmay prescribe relative to the operation and maintenance of the \nsource. \n\n\nPage 58:\n(b.2) \nA permit issued or reissued under subsection (b) of \nthis section shall be issued for a five (5) year term unless a \nshorter term is required to comply with the Clean Air Act and \nregulations promulgated thereunder or the permittee requests a \nshorter term, except that a permit for acid deposition control \nshall be issued for a five (5) year term. A permit may be \nterminated, modified, suspended or revoked and reissued for \ncause. The terms and conditions of an expired permit are \nautomatically continued pending the issuance of a new permit \nwhere the permittee has submitted a timely and complete \napplication for a new permit and paid the fees required by", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-173", "section": "6.3", "title": "or the regulations promulgated under this act and", "text": "section 6.3 or the regulations promulgated under this act and\nthe department is unable, through no fault of the permittee, \nto issue or deny a new permit before the expiration date of the \nprevious permit. Failure of the department to issue or deny a \nnew permit prior to the expiration date of the previous permit", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-174", "section": "10.2", "title": "The", "text": "shall be an appealable action as described in section 10.2. The\nhearing board may require that the department take action on \nan application without additional delay. \n(b.3) \nThe board shall by regulation establish adequate, \nstreamlined and reasonable procedures for expeditiously \ndetermining when applications are complete and for expeditious \nreview of applications. The department shall approve or \ndisapprove a complete application, consistent with the \nprocedures established by the board for consideration of such \napplications, within eighteen (18) months after the date of \nreceipt of the complete application except that the department \nshall establish a phased schedule for acting on permit \napplications submitted within the first full year after the \neffective date of the Title V permit program established to \nimplement the requirements of the Clean Air Act. The schedule \nshall assure that at least one-third of such permits shall be \nacted upon by the department annually over a period not to \nexceed three (3) years after such effective date. Failure of \nthe department to issue or deny a permit by a deadline \nestablished by this subsection shall be an appealable action", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-175", "section": "10.2", "title": "of this act. The hearing board may", "text": "as described in section 10.2 of this act. The hearing board may\nrequire that the department take action on an application \nwithout additional delay. \n(b.4)", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-176", "section": "1", "title": "During the term of a permit, a permittee may", "text": "(1)\nDuring the term of a permit, a permittee may \nreactivate any source under the permit that has been out of \noperation or production for a period of one year or more, \nprovided that the permittee has submitted a reactivation plan \nto and received written approval from the department. The \nreactivation plan shall describe the measures that will be taken \nto ensure the source will be reactivated in compliance with all \napplicable permit requirements. A reactivation plan may be \nsubmitted to and approved by the department at any time during \nthe term of a permit. The department shall take action on the \nreactivation plan within thirty (30) days unless the department \ndetermines that additional time is needed based on the size or \ncomplexity of the reactivated source.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-177", "section": "2", "title": "A reactivation plan may also be submitted to and", "text": "(2)\nA reactivation plan may also be submitted to and \napproved by the department as part of the plan approval or \npermit application process. An owner or operator who has an \napproved reactivation plan shall notify the department prior \nto the reactivation of the source. \n(b.5) \nThe board shall adopt the regulations required by", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-178", "section": "i", "title": "ons (b.l), (b.3) and (i) as part of the regulatory", "text": "subsections (b.l), (b.3) and (i) as part of the regulatory\npackage to implement the operating permit program required by \nTitle V of the Clean Air Act. \n\n\nPage 59:\n(c) \nA plan approval or permit issued hereunder may be \nterminated, modified, suspended or revoked and reissued if the \npermittee constructs or operates the source subject to the plan \napproval or permit in such a manner as to be in violation of \nthis act, the Clean Air Act, the regulations promulgated under \neither this act or the Clean Air Act, a plan approval or permit \nor in such a manner as to cause air pollution, if the permittee \nfails to properly or adequately maintain or repair any air \npollution control device or equipment attached to or otherwise \nmade a part of the source, if the permittee has failed to submit \na report required by a plan approval or operating permit under \nthis section or if the Environmental Protection Agency \ndetermines that the permit is not in compliance with the \nrequirements of the Clean Air Act or the regulations promulgated \nunder the Clean Air Act. \n(d) \nThe department may refuse to grant plan approval for \nany stationary air contamination source subject to the \nprovisions of subsection (a) of this section or to issue a \npermit to any source that the department determines is likely \nto cause air pollution or to violate this act, the Clean Air \nAct or the regulations promulgated under either this act or the \nClean Air Act applicable to such source or if, in the design \nof such source, no provision is made for adequate verification \nof compliance, including source testing or alternative means \nto verify compliance. The department may also refuse to issue \na permit or may for cause terminate or revoke and reissue any \npermit to any person if the Environmental Protection Agency \ndetermines that the permit is not in compliance with the \nrequirements of the Clean Air Act or the regulations promulgated \nunder the Clean Air Act or if the applicant has constructed, \ninstalled, modified or operated any air contamination source \nor installed any air pollution control equipment or device on \nsuch source contrary to the plans and specifications approved \nby the department. \n(e) \nWhenever the department shall refuse to grant an \napproval or to issue or reissue a permit hereunder or terminate, \nmodify, suspend or revoke a plan approval or permit already \nissued, such action shall be in the form of a written notice \nto the person affected thereby informing him of the action taken \nby the department and setting forth, in such notice, a full and \ncomplete statement of the reasons for such action. Such notice \nshall be served upon the person affected, either personally or \nby certified mail, and the action set forth in the notice shall \nbe final and not subject to review unless, within thirty (30) \ndays of the service of such notice, any person affected thereby \nshall appeal to the hearing board, setting forth with \nparticularity the grounds relied upon. The hearing board shall \nhear the appeal pursuant to the provisions of the rules and \nregulations relating to practice and procedure before the \nhearing board, and thereafter, shall issue an adjudication \naffirming, modifying or overruling the action of the department. \n(f) \nThe department may by regulation establish a general \nplan approval and a general permit program. After the program \nis established, the department may grant general plan approval \nor a general permit for any category of stationary air \ncontamination source if the department determines that the \nsources in such category are similar in nature and can be \nadequately regulated using standardized specifications and \nconditions. Any applicant proposing to use a general plan \napproval or general permit shall notify the department and \nreceive written approval prior to the proposed use. The \n\n\nPage 60:\ndepartment shall take action on a notification within thirty", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-179", "section": "30", "title": "days.", "text": "(30) days.\n(g) \nThe department may by regulation establish a plan \napproval and permit program for stationary sources operated at \nmUltiple temporary locations. After the program is established, \nthe department may grant a plan approval or issue a single \npermit to any stationary air contamination source that may be \noperated at multiple temporary locations. Such approval or \npermit shall require the owner or operator to notify the \ndepartment and municipality where the operation shall take place \nin advance of each change in location and may require a separate \napplication and permit or approval fee for operations at each \nlocation. Any applicant proposing to use the plan approval or \npermit authorized by this subsection shall notify the department \nand receive written approval prior to the proposed use. The \ndepartment shall take action on a request within thirty (30) \ndays. \n(h) \nThe department shall establish comprehensive plan \napproval and operating permit programs which meet the \nrequirements of this act and the Clean Air Act.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-180", "section": "", "title": "", "text": "(i)\nThe board shall by regulation establish provisions to \nallow changes within a permitted facility or one operating", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-181", "section": "6.1", "title": "without", "text": "pursuant to clause (3) of subsection (b) of section 6.1 without\nrequiring a permit revision, if the changes are not \nmodifications under any provision of 42 U.S.C. Ch. 85 Subch. I \n(relating to programs and activities) and the changes do not \nexceed the emissions allowable under the permit whether \nexpressed therein as a rate of emissions or in terms of total \nemissions, provided that the facility provides the administrator \nand the department with written notification at least seven (7) \ndays in advance of the proposed changes, unless the board \nprovides in its regulations a different time frame for \nemergencies. \n(j) \nThe department shall make available to the public any \npermit application, compliance plan, permit and monitoring or \ncompliance report required by this act. \n(k) \nThe department shall require revisions to any permit \nto incorporate applicable standards and regulations promulgated \nunder the Clean Air Act after the issuance of such permit. Such \nrevisions shall occur as expeditiously as practicable, but not \nlater than eighteen (18) months after the promulgation of such \nstandards and regulations. No such revision shall be required \nif the effective date of the standards or regulations is a date \nafter the expiration of the permit term or if less than three", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-182", "section": "3", "title": "years remain on the permit. Such permit revision shall be", "text": "(3) years remain on the permit. Such permit revision shall be\ntreated as a permit renewal if it complies with the requirements \nof this act regarding renewals.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-183", "section": "6.2", "title": "Emergency Procedure", "text": "Section 6.2.\nEmergency Procedure.--(a) \nAny other provision \nof law to the contrary notwithstanding, if the department finds, \nin accordance with the rules and regulations of the board \nadopted under the provisions of clause (5) of section 5 of this \nact, that a generalized condition of air pollution exists and \nthat it creates an emergency requiring immediate action to \nprotect human health or safety, the department, with the \nconcurrence of the Governor, shall order or direct persons \ncausing or contributing to the air pollution to immediately \nreduce or discontinue the emission of air contaminants. ((a) \namended July 9, 1992, P.L.460, No.95) \n(b) \nIn the absence of a generalized condition of air \npollution, if the department finds that emissions from the \noperation of one or more air contamination sources are creating \n\n\nPage 61:\nan imminent danger to human health or safety, the department \nmay, without regard to the provisions of section 4 of this act, \norder the persons responsible for the operation of the air \ncontamination sources in question to immediately reduce or \ndiscontinue the emission of air contaminants. \n(c) \nAn order issued under subsection (a) or (b) of this \nsection shall fix a place and time, not later than twenty-four \nhours thereafter, for a hearing to be held before the hearing \nboard. Within twenty-four hours after the commencement of such \nhearing, and without adjournment thereof, the hearing board \nshall affirm, modify or set aside the order of the department. \n(d) \nThis section shall not be construed to limit any power \nwhich the Governor or any other officer may have to declare an \nemergency and act on the basis of such declaration.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-184", "section": "6.3", "title": "Fees", "text": "Section 6.3.\nFees.--(a) \nThis section authorizes the \nestablishment of fees sufficient to cover the indirect and \ndirect costs of administering the air pollution control plan \napproval process, operating permit program required by Title V \nof the Clean Air Act, other requirements of the Clean Air Act \nand the indirect and direct costs of administering the Small \nBusiness Stationary Source Technical and Environmental \nCompliance Assistance Program, Compliance Advisory Committee \nand Office of Small Business Ombudsman. This section also \nauthorizes the board by regulation to establish fees to support \nthe air pollution control program authorized by this act and", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-185", "section": "502(b)", "title": "of the Clean Air", "text": "not covered by fees required by section 502(b) of the Clean Air\nAct. \n(b) \nAn annual interim air emission fee of fourteen dollars \n($14.00) per ton on emissions of sulfur dioxide, nitrogen \noxides, particulate matter of ten (10) microns or less and \nvolatile organic compounds is hereby established to cover the \nreasonable direct and indirect costs of developing and \nadministering the air pollution control operating permit program \nrequired by Title V of the Clean Air Act, other requirements \nof the Clean Air Act and the reasonable indirect and direct \ncosts of administering the Small Business Stationary Source \nTechnical and Environmental Compliance Assistance Program, \nCompliance Advisory Committee and the Office of Small Business \nOmbudsman to be collected during fiscal year 1992-1993 covering \nactual emissions occurring in calendar year 1991, fiscal year \n1993-1994 covering actual emissions occurring in calendar year \n1992 and fiscal year 1994-1995 covering actual emissions \noccurring during calendar year 1993. The interim fee shall not \napply to air emissions of less than one hundred (100) tons for \nany of the listed pollutants, provided that when emissions \nexceed one hundred (100) tons the entire amount of all air \nemissions for any of the listed pollutants up to five thousand \nfive hundred (5,500) tons shall be chargeable emissions for \ninterim fee purposes. \n(c) \nThe board shall establish by regulation a permanent \nannual air emission fee as required for regulated pollutants", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-186", "section": "502(b)", "title": "of the Clean Air Act to cover the reasonable", "text": "by section 502(b) of the Clean Air Act to cover the reasonable\ndirect and indirect costs of administering the operating permit \nprogram required by Title V of the Clean Air Act, other related \nrequirements of the Clean Air Act and the reasonable indirect \nand direct costs of administering the Small Business Stationary \nSource Technical and Environmental Compliance Assistance \nProgram, Compliance Advisory Committee and the Office of Small \nBusiness Ombudsman to be collected starting in fiscal year \n1995-1996 covering air emissions occurring during calendar year", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-188", "section": "", "title": "", "text": "(i)\nFor purposes of this section, the baseline amount \nshall be computed, in accordance with such guidance as the \nadministrator may provide, as the lower of the amount of actual \nVOC emissions (referred to as actuals) or VOC emissions allowed \nunder the permit applicable to the source or, if no such permit \nhas been issued for the attainment year, the amount of VOC \nemissions allowed under the applicable implementation plan \n(referred to as allowables) during the attainment year.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-189", "section": "i", "title": "thstanding subclause (i) of this clause, the", "text": "Notwithstanding subclause (i) of this clause, the\nadministrator may issue guidance authorizing the baseline amount \nto be determined in accordance with the lower of average actuals \nor average allowables determined over a period of more than one", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-190", "section": "1", "title": "calendar year. This guidance may provide that the average", "text": "(1) calendar year. This guidance may provide that the average\ncalculation for a specific source may be used if that source's \nemissions are irregular, cyclical or otherwise vary \nsignificantly from year to year.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-191", "section": "3", "title": "The fee amount under clause (1) of this subsection shall", "text": "(3)\nThe fee amount under clause (1) of this subsection shall \nbe adjusted annually, beginning 1991 in accordance with", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-192", "section": "i", "title": "ons (h) and (i) of section 6.3.", "text": "subsections (h) and (i) of section 6.3.\n(c) \nFor areas with a total population under two hundred \nthousand (200,000) which fail to attain the standard by the \napplicable attainment date, no sanction under this section or \nunder any other provisions of this act shall apply if the area \ncan demonstrate, consistent with guidance issued by the \nEnvironmental Protection Agency, that attainment in the area \nis prevented because of ozone or ozone precursors transported \nfrom other areas. The prohibition applies only in cases in which \nthe area has met all requirements and implemented all measures \napplicable to the area under the Clean Air Act.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-193", "section": "6.5", "title": "Acid Deposition Control", "text": "Section 6.5.\nAcid Deposition Control.--(a) \nThe department \nis authorized to develop a permit program for acid deposition \ncontrol in accordance with Titles IV and V of the Clean Air Act \nand to submit it to the administrator for approval. \n(b) \nFor purposes of the permit program authorized under \nsubsection (a) of this section, the definitions in sections 402 \nand 501 of the Clean Air Act are incorporated herein by \nreference. \n(c) \nThe owner or operator or the designated representative \nof each source affected under section 405 of the Clean Air Act \nshall submit a permit application and compliance plan for the \naffected source to the department no later than January I, 1996. \nIn the case of affected sources for which application and plans \nare timely received, the permit application and the compliance \nplan, including amendments thereto, shall be binding on the \nowner or operator or the designated representative of the owners \nor operators and shall be enforceable as a permit for purposes \nof this section until a permit is issued by the department. Any \npermit issued by the department shall require the source to \nachieve compliance as soon as possible but no later than the \ndate required by this act, the Clean Air Act or the regulations \npromulgated under either this act or the Clean Air Act for the \nsource. \n(d) \nAt any time after the submission of a permit application \nand compliance plan, the applicant may submit a revised \napplication and compliance plan. In considering any permit \napplication and compliance plan under this section, the \ndepartment shall coordinate with the Pennsylvania Public Utility \nCommission consistent with requirements that may be established \nby the administrator. \n(e) \nIn addition to other provisions, permits issued by the \ndepartment shall prohibit all of the following: \n\n\nPage 65:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-194", "section": "1", "title": "Annual emissions of sulfur dioxide in excess of the", "text": "(1)\nAnnual emissions of sulfur dioxide in excess of the \nnumber of allowances to emit sulfur dioxide that the owner or \noperator or designated representative hold for the unit.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-195", "section": "2", "title": "Exceedances of applicable emissions rates or standards,", "text": "(2)\nExceedances of applicable emissions rates or standards, \nincluding ambient air quality standards.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-198", "section": "6.6", "title": "Hazardous Air Pollutants", "text": "Section 6.6. Hazardous Air Pollutants. -- (a)\nThe regulations \nestablishing performance or emission standards promulgated under \nsection 112 of the Clean Air Act are incorporated by reference \ninto the department's permitting program. After the effective \ndate of the performance or emission standard, new, \nreconstructed, modified and existing sources shall comply with \nthe performance or emission standards pursuant to the compliance \nschedule established under section 112 of the Clean Air Act and \nthe regulations promulgated under the Clean Air Act. The \nEnvironmental Quality Board may not establish a more stringent \nperformance or emission standard for hazardous air pollutant \nemissions from existing sources, except as provided in \nsubsection (d). This section shall not apply to rules and \nregulations adopted as final prior to the effective date of \nthis act and shall not be construed to weaken standards for \nindividual sources or facilities in effect prior to the \neffective date of this act. The board may establish performance \nor emission standards for sources or categories of sources which \nare not included on the list of source categories established", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-199", "section": "112 (c)", "title": "of the Clean Air Act. For purposes of this", "text": "under section 112 (c) of the Clean Air Act. For purposes of this\nsection, the term \"performance standard\" includes design, \nequipment, work practice or operational standards or any \ncombination thereof. \n(b) \nIn the event the administrator has not promulgated a \nstandard to control the emissions of hazardous air pollutants \nfor a category or subcategory of major sources under section \n112 of the Clean Air Act, pursuant to a schedule established", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-200", "section": "112(c)", "title": "of the Clean Air Act, the department", "text": "pursuant to section 112(c) of the Clean Air Act, the department\nshall have the authority to establish a performance or emission \nstandard on a case-by-case basis for individual sources or a \ncategory of sources. The department shall have the authority", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-201", "section": "112 (g)", "title": "(2) of the", "text": "to make the determinations required by section 112 (g) (2) of the\nClean Air Act regarding the construction, reconstruction and \nmodification of sources. Any person challenging the performance \nor emission standards established by the department shall have \nthe burden to demonstrate that the performance or emission \nstandard does not meet the requirements of section 112 of the \nClean Air Act. The department shall incorporate the standard \nto control the emissions of hazardous air pollutants into the \nplan approval or operating permit of any source within the \ncategory or subcategory. The performance or emission standard \nestablished on a case-by-case basis by the department shall be \nequivalent to the limitation that would apply to the source if \na performance or emission standard had been promulgated by the \nadministrator under section 112 of the Clean Air Act. \n(c) \nThe department is authorized to require that new sources \ndemonstrate in the plan approval application that the source \nwill reduce or control emissions of air pollutants, including \nhazardous air pollutants, by using the best available \ntechnology. \n(d)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-202", "section": "1", "title": "When needed to protect public health, welfare and", "text": "(1)\nWhen needed to protect public health, welfare and \nthe environment from emissions of hazardous air pollutants from \nnew and existing sources, the department may impose health \n\n\nPage 66:\nrisk-based emission standards or operating practice \nrequirements. In developing such health risk-based emission \nstandards or operating practice requirements, the department \nshall provide an explanation and rationale for such standards \nor requirements and provide for public review and comments on \nplan approvals, operating permits, guidelines and regulations \nwhich contain health risk-based emission standards or operating \npractice requirements. Standards or requirements adopted \npursuant to this subsection shall be developed using an analysis \nwhich, among other factors, considers, where appropriate for a \nsource or source category, the criteria set forth in section", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-203", "section": "112(f)", "title": "(1) of the Clean Air Act in assessing the proposed risk", "text": "112(f) (1) of the Clean Air Act in assessing the proposed risk\nto the public health, welfare and the environment from the \nsource.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-204", "section": "2", "title": "In the case of coke oven batteries, the department may", "text": "(2)\nIn the case of coke oven batteries, the department may \nnot impose health risk-based emission standards more stringent \nthan Federal requirements until eight (8) years after \npromulgation of maximum achievable control technology (MACT) \nstandards and not until the year 2020 for coke oven batteries", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-206", "section": "3", "title": "Notwithstanding the limitation in clause (2), where the", "text": "(3)\nNotwithstanding the limitation in clause (2), where the \noperation of a coke oven battery would result in serious, \nsubstantial and demonstrable harm to public health, welfare and \nthe environment, the department may impose health risk-based \nemission standards by regulation which utilize proven, \ncommercially available and economically available methods of \ntechnology.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-207", "section": "", "title": "", "text": "(i)\nThe department shall not impose health risk-based \nemission standards until after January 1, 1998, for those coke \noven batteries which satisfy the applicable MACT or lowest \nachievable emission rate (LAER) standards.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-208", "section": "ii", "title": "After January 1, 1998, the department shall only impose", "text": "(ii) After January 1, 1998, the department shall only impose\nhealth risk-based emission standards adopted pursuant to section", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-209", "section": "112(f)", "title": "of the Clean Air Act,", "text": "are adopted pursuant to section 112(f) of the Clean Air Act,\nthe department may adopt such emission standards, provided that \nsuch standards are consistent with the criteria and the factors", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-210", "section": "112(f)", "title": "of the Clean Air Act", "text": "set forth in clause (1) and section 112(f) of the Clean Air Act\nand until such time as health risk-based standards are enacted", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-211", "section": "112(f)", "title": "of the", "text": "by the Federal Government pursuant to section 112(f) of the\nClean Air Act. \n(e) \nThe department shall have the authority to require, in \nthe plan approval and operating permit, reasonable monitoring, \nrecordkeeping and reporting requirements for sources which emit \nhazardous air pollutants. \n(f) \nNothing in this section shall preclude the department \nfrom taking an emergency action where there is an immediate or \npotential threat to public health, welfare and the environment \nfrom an air pollutant, including a hazardous air pollutant. \n(g) \nThe early emissions reduction program authorized under", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-212", "section": "112(i)", "title": "(5) of the Clean Air Act is incorporated by", "text": "section 112(i) (5) of the Clean Air Act is incorporated by\nreference in the department's permitting program.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-215", "section": "7", "title": "Public Hearings", "text": "Section 7.\nPublic Hearings.--(a) \nPublic hearings shall be \nheld by the board or by the department, acting on behalf and \nat the direction or request of the board, in any region of the \nCommonwealth affected before any rules or regulations with \n\n\nPage 67:\nregard to the control, abatement, prevention or reduction of \nair pollution are adopted for that region or subregion. When \nit becomes necessary to adopt rules and regulations for the \ncontrol, abatement, prevention or reduction of air pollution \nfor more than one region of the Commonwealth, the board may \nhold one hearing for any two contiguous regions to be affected \nby such rules and regulations. Such hearing may be held in \neither of the two contiguous regions. In the case where it \nbecomes necessary to adopt rules and regulations for the \ncontrol, abatement, prevention or reduction of air pollution \nfor any area of the Commonwealth which encompasses more than \none region or parts of more than one region, public hearings \nshall be held in the area concerned. Full stenographic \ntranscripts shall be taken of all public hearings and shall be \nmade available by the department to any party concerned with \nthe subject matter of the hearing upon the payment of prevailing \nrates for such transcripts. \n(b) \nIn addition to the matters discussed at the public \nhearings, the board may, in its discretion, solicit the views, \nin writing, of persons who may be affected by, or interested \nin, proposed rules and regulations. \n(c) \nNotice to the public of the time and place of any public \nhearing shall be given at least thirty (30) days prior to the \nscheduled date of the hearing by public advertisement in a \nnewspaper or newspapers of general circulation in the region \nof the Commonwealth affected. \n(d) \nThe persons designated to conduct the hearing shall \nhave the power to issue notices of hearings in the name of the \nboard. \n(e) \nFull opportunity to be heard with respect to the subject \nof the hearing shall be given to all persons in attendance, in \naddition to which persons, whether or not in attendance, may, \nwithin thirty (30) days, submit their views to the department, \nwhich the department shall transmit to the board with its \nreport. \n(7 amended Oct. 26, 1972, P.L.989, No.245)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-216", "section": "7.1", "title": "Compliance Review", "text": "Section 7.1.\nCompliance Review.--(a) \nThe department shall \nnot issue, reissue or modify any plan approval or permit \npursuant to this act or amend any plan approval or permit issued \nunder this act and may suspend, terminate or revoke any permit \nor plan approval previously issued under this act if it finds \nthat the applicant or permittee or a general partner, parent \nor subsidiary corporation of the applicant or permittee is in \nviolation of this act, or the rules and regulations promulgated \nunder this act, any plan approval, permit or order of the \ndepartment, as indicated by the department's compliance docket, \nunless the violation is being corrected to the satisfaction of \nthe department. \n(b) \nThe department may refuse to issue any plan approval \nor permit pursuant to this act if it finds that the applicant \nor permittee or a partner, parent or subsidiary corporation of \nthe applicant or permittee has shown a lack of intention or \nability to comply with this act or the regulations promulgated \nunder this act or any plan approval, permit or order of the \ndepartment, as indicated by past or present violations, unless \nthe lack of intention or ability to comply is being or has been \ncorrected to the satisfaction of the department. \n(c) \nIn performing the compliance review required under this \nsection, the department shall only consider violations arising \nunder this act that occurred or are occurring in Pennsylvania. \n\n\nPage 68:\n(d) \nA permittee or applicant may appeal any violation \narising under this act which the department places on the \ncompliance docket.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-217", "section": "", "title": "", "text": "section 7.2.\nPermit Compliance Schedules.--In addition to \nthe other enforcement provisions of this act, the department \nmay issue a permit under clauses (3) and (4) of subsection (b)", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-218", "section": "6.1", "title": "to a source that is out of compliance with this", "text": "of section 6.1 to a source that is out of compliance with this\nact, the Clean Air Act or the regulations promulgated under \neither this act or the Clean Air Act. Any such permit must \ncontain an enforceable schedule requiring the source to attain \ncompliance. The compliance schedule may contain interim \nmilestone dates for completing any phase of the required work, \nas well as a final compliance date, and may contain stipulated \npenalties for failure to meet the compliance schedule. If the \npermittee fails to achieve compliance by the final compliance \ndate, the permit shall terminate. The permit shall be part of \nan overall resolution of the outstanding noncompliance and may \ninclude the payment of an appropriate civil penalty for past \nviolations and shall contain such other terms and conditions \nas the department deems appropriate. A permit may incorporate \nby reference a compliance schedule contained within a consent \norder and agreement, including all provisions related to \nimplementation or enforcement of the compliance schedule or \nconsent order and agreement.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-219", "section": "7.3", "title": "Responsibilities of Owners and", "text": "Section 7.3.\nResponsibilities of Owners and \nOperators.--(a) \nWhenever the department finds that air \npollution or danger of air pollution is or may be resulting \nfrom an air contamination source in the Commonwealth, the \ndepartment may order the owner or operator to take corrective \naction in a manner satisfactory to the department, or it may \norder the owner or operator to allow access to the land by the \ndepartment or a third party to take such action. \n(b) \nFor purposes of collecting or recovering the costs \ninvolved in taking corrective action or pursuing a cost recovery \naction pursuant to an order or recovering the cost of \nlitigation, oversight, monitoring, sampling, testing and \ninvestigation related to a corrective action, the department \nmay collect the amount in the same manner as civil penalties \nare assessed and collected following the process for assessment", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-220", "section": "7.4", "title": "Interstate Transport Commission", "text": "Section 7.4.\nInterstate Transport Commission.--(a) \nThe \nCommonwealth, through its representatives on an interstate \ntransport commission formed under the Clean Air Act, shall \nprovide public review of recommendations for additional control \nmeasures prior to final commission action consistent with the", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-221", "section": "184 (c)", "title": "(1)", "text": "commission's public review requirements under section 184 (c) (1)\nof the Clean Air Act. The opportunity for public review \nestablished under this section shall run concurrently with the \ncommission's public comment period established under section", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-222", "section": "184 (c)", "title": "(1) of the Clean Air Act.", "text": "184 (c) (1) of the Clean Air Act.\n(b) \nControl strategies approved by an interstate transport \ncommission and by the Commonwealth's representatives and set \nforth in resolutions or memoranda of understanding shall be \nconsidered commitments by the executive to pursue subsequent \nlegislative, regulatory or other administrative actions to \nimplement the control strategies. \n(c) \nThe Commonwealth strongly recommends that an interstate \ntransport commission adopt formal procedures which allow for \nan open public review and comment period prior to the adoption \n\n\nPage 69:\nof resolutions or consideration of memoranda of understanding \nor other actions which recommend that states adopt control \nstrategies. The Commonwealth's representatives shall take \nactions consistent with this recommendation. \n(d) \nThe General Assembly of Pennsylvania finds that the \ninterstate transport of pollutants from the State of Ohio \ncontributes significantly to the violation of national ambient \nair quality standards by the Commonwealth. Therefore, as set \nforth in section 176A of the Clean Air Act, the Governor, on \nbehalf of the Commonwealth, may petition the Federal EPA \nAdministrator to include the State of Ohio in any interstate \ntransport commission to which Pennsylvania is a member state.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-223", "section": "7.5", "title": "Public Review of State Implementation", "text": "Section 7.5.\nPublic Review of State Implementation \nPlans.--(a) \nA State implementation plan required by the Clean \nAir Act which commits the Commonwealth to adopt air pollution \ncontrol measures or procedures shall be the subject of a public \ncomment period. The public comment period shall be no less than \nsixty (60) days, and the department may, at its discretion, \nhold public informational meetings or public hearings as part \nof the comment period. \n(b) \nNotice of a proposed State implementation plan shall \nbe published in the Pennsylvania Bulletin and in sufficient \nnewspapers having general circulation in the area covered by \nthe State implementation plan. If the State implementation plan \ncovers the entire State, notice shall be published in at least \nsix (6) newspapers of general circulation throughout the \nCommonwealth. \n(c) \nA State implementation plan subject to this section \nshall include the following provisions:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-224", "section": "1", "title": "Statements clearly indicating the specific provisions", "text": "(1)\nStatements clearly indicating the specific provisions \nof the Clean Air Act with which the State implementation plan \nis intended to comply.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-225", "section": "2", "title": "An analysis of the alternative control strategies", "text": "(2)\nAn analysis of the alternative control strategies \nconsidered if applicable in arriving at the recommended control \nstrategies and the reasons the department or other agency \nselected the final strategy.", "requirement_type": "recommended", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-226", "section": "3", "title": "An analysis of the economic impact of the alternative", "text": "(3)\nAn analysis of the economic impact of the alternative \ncontrol strategies and the selected strategies on the regulated \ncommunity and local governments.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-227", "section": "4", "title": "An analysis of the staff and technical resources needed", "text": "(4)\nAn analysis of the staff and technical resources needed \nby the department or other agency to implement the control \nstrategy. \n(d) \nAfter the public comment period and prior to the \nsubmission to EPA of any State implementation plan required by \nthe Clean Air Act which commits the Commonwealth to adopt air \npollution control measures or procedures, the department shall \nsubmit a final State implementation plan to the board for its \nreview together with a document which responds to all comments \nmade during the public comment period. \n(d.l) \nThe following shall apply to a State implementation \nplan and any revision to such plan proposed or finalized after \nthe effective date of this sUbsection:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-228", "section": "1", "title": "The plan or revision developed by the department, other", "text": "(1)\nThe plan or revision developed by the department, other \nState agency or local air pollution control agency shall be \npublished and maintained on the publicly accessible Internet \nwebsite of the department, other State agency or local air \npollution control agency that developed the plan or revision.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-229", "section": "2", "title": "The plan or revision developed by the department or", "text": "(2)\nThe plan or revision developed by the department or \nother State agency shall be submitted to the chairman and \nminority chairman of the Environmental Resources and Energy \nCommittee of the Senate and the chairman and minority chairman \n\n\nPage 70:\nof the Environmental Resources and Energy Committee of the House \nof Representatives at the same time as the plan or revision is \npublished for public comment or submitted to the board, \nwhichever is applicable. \n((d.1) added Apr. 12, 2012, P.L.230, No.27) \n(e) \nThese provisions shall also apply in the case of State \nimplementation plans required by the Clean Air Act which are \ndeveloped by State agencies other than the department which \ncommit the Commonwealth to the adoption of air pollution control \nmeasures or procedures. \n(f) \nSubsections (c) and (d) of this section shall not apply \nto State implementation plans or portions thereof comprised of \npermit, emission offset or reasonably available control \ntechnology requirements for individual sources; consent orders \nand agreements; or regulations. \n(g) \nThe requirements of this section shall not apply to \nstate implementation plans submitted by a local air pollution \ncontrol agency.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-230", "section": "", "title": "", "text": "section 7.6.\nAdvice to Department.--(a) \nThe department \nshall consult with the Citizens Advisory Council established \nunder section 448 of the act of April 9, 1929 (P.L.177, No.175), \nknown as \"The Administrative Code of 1929,\" as appropriate, in \nthe consideration of State implementation plans and regulations \ndeveloped by the department and needed for the implementation \nof the Clean Air Act. Nothing in this section shall limit the \ncouncil's ability to consider, study and review department \npolicies and other activities related to the Clean Air Act \nimplementation as provided under section 1922-A of \"The \nAdministrative Code of 1929.\" This section shall not apply to \nState implementation plans or portions thereof comprised of \npermit, emission offset or reasonably available control \ntechnology requirements for individual sources; consent orders \nand agreements; or regulations. The requirements of this section \nshall not apply to State implementation plans submitted by a \nlocal air pollution control agency. \n(b)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-231", "section": "1", "title": "The Secretary of Environmental Resources, within", "text": "(1)\nThe Secretary of Environmental Resources, within \nthirty (30) days after the effective date of this act, shall \ndesignate an air technical advisory committee. The committee \nshall include at least eleven (11) members with technical \nbackgrounds in the control of air pollution from stationary or \nmobile sources.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-232", "section": "2", "title": "The committee, at the request of the department, may", "text": "(2)\nThe committee, at the request of the department, may \nbe utilized to provide technical advice on department policies, \nguidance and regulations needed to implement the Clean Air Act. \nThe committee may also request to review a department policy, \nguidance or regulation needed to implement the Clean Air Act.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-233", "section": "7.6", "title": "added July 9, 1992, P.L.460, No.95)", "text": "(7.6 added July 9, 1992, P.L.460, No.95)\nCompiler's Note: \nThe Secretary of Environmental Resources, \nreferred to in subsec. (b), was abolished by Act 18 of", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-234", "section": "The functions of the secretary were transferred", "title": "", "text": "1995. The functions of the secretary were transferred\nto the Secretary of Conservation and Natural Resources \nand the Secretary of Environmental Protection.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-235", "section": "7.7", "title": "Small Business Compliance Assistance", "text": "Section 7.7.\nSmall Business Compliance Assistance \nProgram.--(a) \nThe department shall develop and implement a \nSmall Business Stationary Source Technical and Environmental \nCompliance Assistance Program which shall include the following:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-236", "section": "1", "title": "Adequate mechanisms for developing, collecting and", "text": "(1)\nAdequate mechanisms for developing, collecting and \ncoordinating information concerning compliance methods and \ntechnologies for small business stationary sources and programs \n\n\nPage 81:\nAir Act, this act or a regulation adopted under this act, the \nfines and penalties collected shall not be subject to this \nsubsection and subsection (a.2).", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-237", "section": "7", "title": "A municipality may assign its claim to funding under", "text": "(7)\nA municipality may assign its claim to funding under \nclause (1) to the county in which the violation occurred within \nthe one hundred eighty (180) day period specified in clause", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-238", "section": "3", "title": ". The county shall submit a project proposal in compliance", "text": "(3). The county shall submit a project proposal in compliance\nwith clause (1) to the department for review and approval within \nforty-five (45) days of the expiration of the one hundred eighty", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-239", "section": "8", "title": "If a municipality does not submit a project proposal", "text": "(8)\nIf a municipality does not submit a project proposal \nwithin the one hundred eighty (180) day period specified in \nclause (3) or provides notification of its intent not to file \na project proposal during the one hundred eighty (180) day \nperiod, the county in which the violation occurred may submit \na project proposal in compliance with clause (1) to the \ndepartment for review and approval within forty-five (45) days \nof the expiration of the one hundred eighty (180) day period. \n(a.2) \nwithin five (5) business days of imposition of a fine \nor civil penalty under this act, the department shall notify \nthe municipality in which the violation occurred of the \nviolation. \n(b) \nThe Clean Air Fund may be supplemented by appropriations \nfrom the General Assembly, the Federal, State or local \ngovernment or any private source. \n(c) \nThe Clean Air Fund shall not be subject to 42 Pa.C.S. \nCh. 37 Subch. C (relating to judicial computer system) .", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-240", "section": "9.3", "title": "Continuing Violations", "text": "Section 9.3.\nContinuing Violations.--Each day of continued \nviolation and each violation of any provision of this act, any \nrule or regulation adopted under this act or any order of the \ndepartment or any condition or term of any plan approval or \npermit issued pursuant to this act shall constitute a separate \noffense and violation.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-242", "section": "10.1", "title": "Enforcement Orders", "text": "Section 10.1.\nEnforcement Orders.--(a) \nThe department may \nissue such orders as are necessary to aid in the enforcement \nof the provisions of this act. These orders shall include, but \nshall not be limited to, orders modifying, suspending, \nterminating or revoking any plan approvals or permits, orders \nrequiring persons to cease unlawful activities or cease \noperation of a facility or air contamination source which, in \nthe course of its operation, is in violation of any provision \nof this act, any rule or regulation promulgated under this act \nor plan approval or permit, order to take corrective action or \nto abate a public nuisance or an order requiring the testing, \nsampling or monitoring of any air contamination source or orders \nrequiring production of information. Such an order may be issued \nif the department finds that any condition existing in or on \nthe facility or source involved is causing or contributing to \nor is creating a danger of air pollution or if it finds that \nthe permittee or any person is in violation of any provision \nof this act or of any rule, regulation or order of the \ndepartment. \n(b) \nThe department may, in its order, require compliance \nwith such conditions as are necessary to prevent or abate air \npollution or effect the purposes of this act. \n(c) \nAn order issued under this section shall take effect \nupon notice, unless the order specifies otherwise. An appeal \nto the hearing board of the department's order shall not act \n\n\nPage 82:\nas a supersedeas, provided, however, that, upon application and \nfor cause shown, the hearing board may issue such a supersedeas \nunder rules established by the hearing board. \n(d) \nThe authority of the department to issue an order under \nthis section is in addition to any remedy or penalty which may \nbe imposed pursuant to this act. The failure to comply with any \nsuch order is hereby declared to be a public nuisance.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-243", "section": "", "title": "", "text": "section 10.2.\nAppealable Actions.--Any person aggrieved by \nan order or other administrative action of the department issued \npursuant to this act or any person who participated in the \npublic comment process for a plan approval or permit shall have \nthe right, within thirty (30) days from actual or constructive \nnotice of the action, to appeal the action to the hearing board \nin accordance with the act of July 13, 1988 (P.L.530, No.94), \nknown as the Environmental Hearing Board Act, and 2 Pa.C.S. Ch. \n5 Subch. A (relating to practice and procedure of Commonwealth \nagencies) .", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-244", "section": "10.3", "title": "Limitation on Action", "text": "Section 10.3.\nLimitation on Action.--The provisions of any \nother statute to the contrary notwithstanding, actions for civil \nDr criminal penalties under this act may be commenced at any \ntime within a period of seven (7) years from the date the \noffense is discovered.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-245", "section": "11", "title": "Powers Reserved to the Department Under Existing", "text": "Section 11.\nPowers Reserved to the Department Under Existing \nLaws.--Nothing in this act shall limit in any way whatever the \npowers conferred upon the department under laws other than this \nact, it being expressly provided that all such powers are \npreserved to the department and may be freely exercised by it. \nNo court exercising general equitable jurisdiction shall be \ndeprived of such jurisdiction even though a nuisance or \ncondition detrimental to health is subject to regulation Dr \nother action by the board under this act. \n(11 amended July 9, 1992, P.L.460, No.95)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-246", "section": "12", "title": "Powers Reserved to Political", "text": "Section 12.\nPowers Reserved to Political \nSubdivisions.--(a) \nNothing in this act shall prevent counties, \ncities, towns, townships or boroughs from enacting ordinances \nwith respect to air pollution which will not be less stringent \nthan the provisions of this act, the Clean Air Act or the rules \nand regulations promulgated under either this act or the Clean \nAir Act. This act shall not be construed to repeal existing \nordinances, resolutions or regulations of the aforementioned \npolitical subdivisions existing at the time of the effective \ndate of this act, except as they may be less stringent than the \nprovisions of this act, the Clean Air Act or the rules or \nregulations adopted under either this act Dr the Clean Air Act. \n(b) \nThe administrative procedures for the abatement, \nreduction, prevention and control of air pollution set forth \nin this act shall not apply to any county of the first or second \nclass of the Commonwealth which has and implements an air \npollution control program that, at a minimum, meets the \nrequirements of this act, the Clean Air Act and the rules and \nregulations promulgated under both this act and the Clean Air \nAct and has been approved by the department. \n(b.1) \nProvisions of this act pertaining to dust control \nmeasures shall not apply to portions of highways in townships \nof the second class where no businesses or residences are \nlocated. ((b.1) added Nov. 28, 1995, P.L.645, No.68) \n(c)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-247", "section": "1", "title": "Whenever, either upon complaint made to or", "text": "(1)\nWhenever, either upon complaint made to or \ninitiated by the department, the department finds that any \nperson is in violation of air pollution control standards, or \n\n\nPage 83:\nrules and regulations promulgated pursuant to the grant of \nauthority made in subsection (b), the department shall give \nnotification of that fact to that person and to the air \npollution control agency of the county involved.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-248", "section": "2", "title": "If such violation continues to exist after said", "text": "(2)\nIf such violation continues to exist after said \nnotification has been given, the department may take any \nabatement action provided for under the terms of this act. \n(d) \nWhenever the department finds that violations of this \nact or the rules and regulations promulgated under this act are \nso widespread that such violations appear to result from a \nfailure of the local county control agency involved to enforce \nthose requirements, the department may assume the authority to \nenforce this act in that county. \n(e) \nThe department shall have the power to refuse approval, \nor to suspend or rescind approval, once given, to any county \nair pollution control agency if the department finds that such \ncounty agency is unable or unwilling to conduct an air pollution \ncontrol program to abate or reduce air pollution problems within \nits jurisdiction in accordance with the requirements of this \nact, the Clean Air Act or the rules and regulations promulgated \nunder both this act and the Clean Air Act. \n(f) \nWhenever the department takes action under the \nprovisions of subsections (d) or (e) of this section, it shall \ngive written notification to the air pollution control agency \nof the county involved and such notification shall be an \nappealable action. \n(g) \nIrrespective of subsection (b) above, and in order that \nthe civil and criminal penalties and equitable remedies for air \npollution violations shall be uniform throughout the \nCommonwealth, the penalties and remedies set forth in this act \nshall be the penalties and remedies available for enforcement \nof any municipal air pollution ordinances or regulations, and \nshall be available to any municipality, public official, or \nother person having standing to initiate proceedings for the \nenforcement of such municipal ordinances or regulations, and \nthe amounts of the fines or civil penalties set forth herein \nshall be the amounts of the fines or civil penalties assessable \nand to be levied for violations of any municipal ordinances or \nregulations. It is hereby declared to be the purpose of this \nsection to enunciate further that the purpose of this act is \nto provide additional and cumulative remedies to abate the \npollution of the air of this Commonwealth. Any action for the \nassessment of civil penalties brought for the enforcement of a \nmunicipal air pollution ordinance or regulation shall be brought \nin accordance with the procedures set forth in such ordinance. \nWhere any municipal ordinance or regulation does not provide a \nprocedure for the assessment of civil penalties, the provisions \nrelated to assessment and collection of civil penalties of", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-249", "section": "9.1", "title": "shall apply.", "text": "section 9.1 shall apply.\n(h) \nNothing in this act shall affect the Municipal Planning \nCode unless required by the Clean Air Act. \n(12 amended July 9, 1992, P.L.460, No.95)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-250", "section": "12.1", "title": "Construction", "text": "Section 12.1.\nConstruction.--Nothing in this act shall be \nconstrued as estopping the Commonwealth, or any district \nattorney or solicitor of a municipality, from proceeding in \ncourts of law or equity to abate pollutions forbidden under \nthis act, or abate nuisances under existing law. It is hereby \ndeclared to be the purpose of this act to provide additional \nand cumulative remedies to abate the pollution of the air of \nthis Commonwealth, and nothing contained in this act shall in \nany way abridge or alter rights of action or remedies now or \nhereafter existing in equity, or under the common law or \n\n\nPage 85:\nof such report, record or information to Federal, State or local \nrepresentatives as necessary for purposes of administration of \nany Federal, State or local air pollution control laws, or when \nrelevant in any proceeding under this act.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-254", "section": "13.6", "title": "Suits to Abate Nuisances and Restrain", "text": "Section 13.6.\nSuits to Abate Nuisances and Restrain \nViolations.--(a) \nAny activity or condition declared by this \nact to be a nuisance or which is otherwise in violation of this \nact shall be abatable in the manner provided by law or equity \nfor the abatement of public nuisance. In addition, in order to \nrestrain or prevent any violation of this act or the rules and \nregulations promulgated under this act or any plan approval or \npermit or orders issued by the department or to restrain the \nmaintenance and threat of public nuisance, suits may be \ninstituted in equity or at law in the name of the Commonwealth \nupon relation of the Attorney General, the General Counsel, the \ndistrict attorney of any county or the solicitor of any \nmunicipality affected after notice has first been served upon \nthe Attorney General of the intention of the General Counsel, \ndistrict attorney or solicitor to so proceed. Such proceedings \nmay be prosecuted in the Commonwealth Court or in the court of \ncommon pleas of the county where the activity has taken place, \nthe condition exists or the public is affected, and, to that \nend, jurisdiction is hereby conferred in law and equity upon \nsuch courts. Except in cases of emergency where, in the opinion \nof the court, the exigencies of the case require immediate \nabatement of the nuisance, the court may, in its decree, fix a \nreasonable time during which the person responsible for the \nnuisance may make provision for the abatement of the same. \n(b) \nIn cases where the circumstances require it or the \npublic health is endangered, a mandatory preliminary injunction, \nspecial injunction or temporary restraining order may be issued \nupon the terms prescribed by the court, notice of the \napplication therefor having been given to the defendant in \naccordance with the rules of equity practice, and, in any such \ncase, the Attorney General, the General Counsel, the district \nattorney or the solicitor of any municipality shall not be \nrequired to give bond. In any such proceeding the court shall, \nupon motion of the Commonwealth, issue a prohibitory or \nmandatory preliminary injunction if it finds that the defendant \nis engaging in unlawful conduct as defined by this act or is \nengaged in conduct which is causing immediate and irreparable \nharm to the public. In addition to an injunction, the court in \nsuch equity proceedings may levy civil penalties in the same", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-255", "section": "", "title": "", "text": "manner as the department in accordance with section 9.1.\n(c) \nExcept as provided in subsection (d) of this section, \nany person may commence a civil action to compel compliance \nwith this act or any rule, regulation, order or plan approval \nor permit issued pursuant to this act by any owner or operator \nalleged to be causing or contributing to a violation of any \nprovision of this act or any rule or regulation promulgated \nunder this act or any plan approval, permit or order issued by \nthe department. In addition to seeking to compel compliance, \nany person may request the court to award civil penalties. The \ncourt shall use the factors and amounts contained in section", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-256", "section": "9.1", "title": "in awarding civil penalties under this subsection. Such", "text": "9.1 in awarding civil penalties under this subsection. Such\n\n\nPage 86:\npenalties shall be paid into the Clean Air Fund established by", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-257", "section": "9.2", "title": "or be used to prevent air pollution in the county", "text": "section 9.2 or be used to prevent air pollution in the county\nwhere the violation occurred. Except where 42 Pa.C.S. (relating \nto judiciary and judicial procedure) requires otherwise, the \ncourts of common pleas shall have jurisdiction of such actions. \nSuch an action may not be commenced if the department has \ncommenced and is diligently prosecuting a civil action in a \nFederal or State court or is in litigation before the hearing \nboard to require the alleged violator to comply with this act, \nany rule or regulation promulgated under this act or any order, \nplan approval or permit issued pursuant to this act, but, in \nany such action in a Federal or State court or before the \nhearing board, any person having or representing an interest \nwhich is or may be adversely affected may intervene as a matter \nof right without posting bond. \n(d) \nAn action pursuant to subsection (c) of this section \nmay not be commenced prior to sixty (60) days after the \nplaintiff has given notice in writing of the violation to the \ndepartment and to any alleged violator. \n(e) \nThe sixty (60) day notice provisions of subsection (d) \nof this section to the contrary notwithstanding, any action \npursuant to subsection (c) of this section may be initiated \nimmediately upon written notification to the department in the \ncase where the violation or condition complained of constitutes \nan imminent threat to the health or safety of the plaintiff or \nwould immediately affect a legal interest of the plaintiff. \n(f) \nThe court, in issuing any final order in any action \nbrought pursuant to subsection (c) of this section, may award \ncosts of litigation, including attorney and expert witness fees, \nto any party whenever the court determines such an award is \nappropriate. Except as provided in subsection (b) of this \nsection, the court may, if a temporary restraining order or \npreliminary injunction is sought, require the filing of a bond \nor equivalent security in accordance with the Pennsylvania Rules \nof Civil Procedure.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-258", "section": "14", "title": "Severability", "text": "Section 14.\nSeverability.--The provisions of this act are \nseverable and if any provision, sentence, clause, section or \npart thereof shall be held illegal, invalid, unconstitutional \nor inapplicable to any person or circumstances, such illegality, \ninvalidity, unconstitutionality or inapplicability shall not \naffect or impair any of the remaining provisions, sentences, \nclauses, sections or parts of the ordinance or their application \nto him or to other persons and circumstances. It is hereby \ndeclared to be the legislative intent that this act would have \nbeen adopted if such illegal, invalid or unconstitutional \nprovision, sentence, clause, section or part had not been \nincluded therein, and if the person or circumstances to which \nthe ordinance or any part thereof is inapplicable had not \nspecifically been exempted therefrom.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-259", "section": "15", "title": "Effective Date", "text": "Section 15.\nEffective Date.--This act shall take effect \nimmediately: Provided, however, That the rules and regulations \npromulgated pursuant to the provisions of this act shall be of \nno effect until one (1) year after the passage of this act. \n\n\nPage 87:\n \n        \n \nAPPENDIX A-4: \n \nDEP Statewide 2013 Annual Network Review  \nEPA Approval Letter \n            \n \nBureau of Air Quality \nDepartment of Environmental Protection \n \n \n \n\n\nPage 91:\n \n        \n \nAPPENDIX A-5: \n \nAllegheny County 2013 Annual Network Review  \nEPA Approval Letter \n            \n \nBureau of Air Quality \nDepartment of Environmental Protection \n \n \n \n\n\nPage 93:\nUNITED STATES ENVIRONMENTAL PROTECTION AGENCY \nREGION Ill \n1650 Arch Street \nPhiladelphia, Pennsylvania 19103-2029 \nMr. James Thompson \nAir Quality Program Manager \nAllegheny County Health Department \n301 39\n111 Street, Building #7 \nPittsburgh, Pennsylvania 15213 \nDear Mr. Thompson: \nBy letter and enclosures dated July 1, 2013, the Allegheny County Health Department (ACHD) \nsubmitted to the U.S. Environmental Protection Agency (EPA) an annual ambient air monitoring \nnetwork plan in accordance with the regulatory requirements of 40 CFR Part 58 - Ambient Air Quality \nSurveillance. Based on our review, EPA approves ACHD's July 1, 2013 annual ambient air monitoring", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-260", "section": "58.11", "title": "(c) requires any changes to the air monitoring network or", "text": "Additionally, 40 CFR Section 58.11(c) requires any changes to the air monitoring network or\ndesign of the following air monitoring systems be approved by the EPA Administrator: \na) Photochemical Assessment Monitoring Systems (PAMS) \nb) Particulate Matter Speciation Trends Network (STN) \nc) The National Core Monitoring Network (NCore) \nEPA determined that ACHD's July 1, 2013 annual ambient air monitoring network plan does not \nrequire approval from the EPA Administrator because there were no changes to any of the air \nmonitoring systems listed above. \nIf you have any questions please do not hesitate to contact me or have your staff contact \nMrs. Laura Mohollen, EPA's Pennsylvania Liaison, at (215) 814-3295. For questions regarding this \napproval action, your staff may contact Ms. Diana Esher, Director, Air Protection Division, at", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-261", "section": "215", "title": "814-2706.", "text": "(215) 814-2706.\ncc: Mr. Darrell Stem, ACHD \nSincerely, \nAt'i?-_ti{ /1:~ \nShawn M. Garvin \nRegional Administrator \n.,. \n'·J \nPrinted on I 00% recycled/recyclable paper with 100% post-consumer fiber and process clllorine free. \nCustomer Service Hotline: 1-800-438-2474 \n\n\nPage 95:\n \n        \n \nAPPENDIX A-6: \n \nPhiladelphia County 2013 Annual Network Review \nEPA Approval Letter \n            \n \nBureau of Air Quality \nDepartment of Environmental Protection \n \n \n \n\n\nPage 97:\nUNITED STATES ENVIRONMENTAL PROTECTION AGENCY \nREGION Ill \n1650 Arch Street \nPhiladelphia, Pennsylvania 19103-2029 \nDr. Donald F. Schwarz, MD, MPH, Health Commissioner \nCity ofPhiladelphia \nDepartment of Public Health \n140 1 JFK Boulevard, Room 600 \nPhiladelphia, Pennsylvania 19102 \nDear Dr. Schwarz: \nBy letter and enclosures dated July 1, 2013, the City of Philadelphia Air Management Services \n(AMS) submitted to the U.S. Environmental Protection Agency (EPA) an annual ambient air monitoring \nnetwork plan in accordance with the regulatory requirements of 40 CFR Part 58 -Ambient Air Quality \nSurveillance. Based on our review, EPA partially approves AMS's July 1, 2013 annual ambient air", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-262", "section": "58.1", "title": "0. EPA", "text": "monitoring network plan on the basis that the plan meets the requirements of 40 CFR Part 58.1 0. EPA\nalso approves your request for exclusion of the PM2.5 continuous FEM data from site 42-101-0004 as", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-264", "section": "215", "title": "814-2706.", "text": "(215) 814-2706.\ncc: Thomas Huynh, AMS \nSincerely, \n~1ir--fd. }i_:_ \nShawn M. Garvin \nRegional Administrator \nt.., ... \nPrinted 011 I 00% recycled/recyclable paper wit It I 00% post-consumer fiber and process chlorine free. \nCustomer Service Hotline: 1-800-438-2474 \n\n\nPage 74:\n(b) \nThe Office of Small Business Ombudsman shall perform \nall functions necessary to implement the requirements of section", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-265", "section": "507 (a)", "title": "(3) of the Clean Air Act. The Office of Small Business", "text": "507 (a) (3) of the Clean Air Act. The Office of Small Business\nOmbudsman shall perform all of the following functions to the \nextent they are consistent with the guidelines developed by the \nEnvironmental Protection Agency:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-266", "section": "1", "title": "Solicit input from small businesses regarding compliance", "text": "(1)\nSolicit input from small businesses regarding compliance \nwith this act and the Clean Air Act and interact with \norganizations representing small businesses, including Small \nBusiness Development Centers, the Small Business Administration, \nindustry and trade associations and other entities.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-267", "section": "2", "title": "Provide guidance and recommendations to the department", "text": "(2)\nProvide guidance and recommendations to the department \non the development of the Small Business Stationary Source \nTechnical and Environmental Compliance Assistance Program.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-268", "section": "3", "title": "Make recommendations to the department regarding the", "text": "(3)\nMake recommendations to the department regarding the \ncontent and operation of the Small Business Stationary Source \nTechnical and Environmental Compliance Assistance Program.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-269", "section": "4", "title": "Collect and distribute information and materials on the", "text": "(4)\nCollect and distribute information and materials on the \nrequirements of this act and the Clean Air Act.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-270", "section": "5", "title": "Report to the Small Business Stationary Source Technical", "text": "(5)\nReport to the Small Business Stationary Source Technical \nand Environmental Compliance Assistance Program on problems and \ndifficulties experienced by small businesses in complying with \nthis act and the Clean Air Act.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-272", "section": "7", "title": "Conduct independent evaluations of all aspects of the", "text": "(7)\nConduct independent evaluations of all aspects of the \nSmall Business Stationary Source Technical and Environmental \nCompliance Assistance Program. \n(S) \nReview and provide comments and recommendations to the \nEnvironmental Protection Agency and department regarding the \ndevelopment and implementation of regulations that impact small \nbusinesses.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-273", "section": "9", "title": "Arrange for and assist in the preparation of guidance", "text": "(9)\nArrange for and assist in the preparation of guidance \ndocuments by the Small Business Stationary Source Technical and \nEnvironmental Compliance Assistance Program to ensure that the \nlanguage is readily understandable by the layperson.", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-274", "section": "10", "title": "Assist small businesses in locating sources of funding", "text": "(10)\nAssist small businesses in locating sources of funding \nfor compliance with the requirements of this act and the Clean \nAir Act. \n(c) \nThe Office of Small Business Ombudsman shall report \nannually to the Governor and General Assembly on the \neffectiveness of the Small Business Stationary Source Technical \nand Environmental Compliance Assistance Program and other issues \nrelating to the impact of the Clean Air Act implementation on \nsmall businesses in the Commonwealth. \n(d) \nFor each proposed rulemaking significantlY affecting \nsmall businesses, the Office of Small Business Ombudsman shall \nprepare a report which contains a detailed analysis of the \neconomic impact of such proposed rulemaking on small businesses. \nThe economic impact report shall be completed no later than \nninety (90) days from the date that the board approves the \nproposed rulemaking and shall be submitted to the board for \nconsideration prior to approval of the final rulemaking package, \nprovided the report is available within the time period \nprescribed by this section. The department shall provide the \nombudsman with a reasonable opportunity to revise the report \nto reflect any proposed substantial change in the rulemaking \nwhich affects the initial report. \n(e) \nThe report shall include, but not be limited to:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-275", "section": "1", "title": "An analysis of the economic impact of the selected", "text": "(1)\nAn analysis of the economic impact of the selected \ncontrol strategies on small business. \n\n\nPage 75:", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-278", "section": "4", "title": "All other information that the Office of Small Business", "text": "(4)\nAll other information that the Office of Small Business \nOmbudsman considers necessary for the board's review. \n(f) \nAll equipment, files, records, contracts, agreements \nand all other materials and supplies which are used, employed \nor expended by the Office of Small Business Ombudsman shall be \ntransferred to the Department of Environmental Protection.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-280", "section": "2", "title": "of Act 174 of 1996, which amended", "text": "Section 2 of Act 174 of 1996, which amended\nsection 7.9, provided that Act 174 shall be retroactively \napplied to January 1, 1991, in dismissing any pending \nlegal or administrative action by the Department of \nEnvironmental Protection arising from any activity which, \nby enactment of Act 174, is not subject to the provisions \nof Act 787.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-281", "section": "7.10", "title": "Associations", "text": "Section 7.10.\nAssociations.--(a) Transportation Management \nThe department, in consultation with the \nDepartment of Transportation, may, after public notice and \ncomment, designate one or more transportation management \nassociations to serve specific regions of this Commonwealth to \nprovide services to employers required by the Clean Air Act to \nreduce employe vehicle trips and encourage the use of \ncarpooling, vanpooling and public transportation to reduce air \npollution. \n(b) \nFor purposes of this section, transportation management \nassociations shall consist of nonprofit corporations designated \nby the department to broker transportation services, including, \nbut not limited to, public transportation, vanpools, carpools, \nbicycling and pedestrian modes, as well as strategies such as \nflextime, staggered work hours and compressed work weeks for \ncorporations, employes, developers, individuals and other \ngroups.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-282", "section": "7.11", "title": "Notice of Sanctions", "text": "Section 7.11.\nNotice of Sanctions.--(a) \nWhenever the \nCommonwealth is notified that the Environmental Protection \nAgency has made a final or proposed finding on a State \nimplementation plan submitted by the Commonwealth or a local \nair pollution control agency, the department shall notify, \nwithin ten (10) working days of receipt of the notice, the \nEnvironmental Resources and Energy Committee of the Senate and \nthe Conservation Committee of the House of Representatives of \nthe agency's findings. \n(b) \nWhenever the Commonwealth is formally notified that it \nis subject to discretionary or mandatory sanctions under section \n179 of the Clean Air Act, the department shall, within ten (10) \nworking days of the receipt of this notice, notify the \nEnvironmental Resources and Energy Committee of the Senate and \nthe Conservation Committee of the House of Representatives.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-283", "section": "7.12", "title": "Missed Federal Deadlines", "text": "Section 7.12.\nMissed Federal Deadlines.--Whenever the \nEnvironmental Protection Agency has missed a deadline for \ndeveloping regulations or guidance on which states must rely \nto comply with deadlines in the Clean Air Act by more than \nninety (90) days and, in the opinion of the department, the \nEnvironmental Protection Agency has failed to provide it with \ntimely guidance needed to comply with the act in a timely \nmanner, the department may bring a legal action against the \nEnvironmental Protection Agency in a court of competent \njurisdiction seeking an injunction to restrain the Environmental \n\n\nPage 76:\nProtection Agency from enforcing the applicable Clean Air Act \ndeadline on the Commonwealth until and unless the Environmental \nProtection Agency develops the appropriate regulation or \nguidance which allows the Commonwealth a reasonable opportunity \nto comply with the Clean Air Act.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-285", "section": "8", "title": "Unlawful Conduct", "text": "Section 8.\nUnlawful Conduct.--It shall be unlawful to fail \nto comply with or to cause or assist in the violation of any \nof the provisions of this act or the rules and regulations \nadopted under this act or to fail to comply with any order, \nplan approval, permit or other requirement of the department; \nor to cause a public nuisance; or to cause air pollution, soil \nor water pollution resulting from an air pollution incident; \nor to hinder, obstruct, prevent or interfere with the department \nor its personnel in their performance of any duty hereunder, \nincluding denying the department access to the source or", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-286", "section": "4903", "title": "", "text": "facility; or to violate the provisions of 18 Pa.C.S. § 4903\n(relating to false swearing) or 4904 (relating to unsworn \nfalsification to authorities) in regard to papers required to \nbe submitted under this act. The owner or operator of an air \ncontamination source shall not allow pollution of the air, water \nor other natural resources of the Commonwealth resulting from \nthe source. For any air pollutant for which the board has set \nan emissions standard or for any source for which a permit has \nbeen issued by the department, a release of such pollutant in \naccordance with that standard or permit shall not constitute a \nviolation of this act. \n(8 amended July 9, 1992, P.L.460, No.95)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-287", "section": "9", "title": "Penalties", "text": "Section 9.\nPenalties.--(a) \nAny person who violates any \nprovision of this act, any rule or regulation adopted under \nthis act, any order of the department or any condition or term \nof any plan approval or permit issued pursuant to this act \ncommits a summary offense and shall, upon conviction, be \nsentenced to pay a fine of not less than one hundred dollars \n($100.00) nor more than two thousand five hundred dollars \n($2,500.00) for each separate offense and, in default of the \npayment of such fine, may be sentenced to imprisonment for \nninety (90) days for each separate offense. Employes of the \ndepartment authorized to conduct inspections or investigations \nare hereby declared to be law enforcement officers authorized \nto issue or file citations for summary violations under this \nact, and the General Counsel is hereby authorized to prosecute \nthese offenses. For purposes of this subsection, a summary \noffense may be prosecuted before any district justice in the \ncounty where the offense occurred. There is no Accelerated \nRehabilitative Disposition authorized for a summary offense. \n(b)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-288", "section": "1", "title": "Any person who wilfully or negligently violates", "text": "(1)\nAny person who wilfully or negligently violates \nany provision of this act, any rule or regulation adopted under \nthis act or any order of the department or any condition or \nterm of any plan approval or permit issued pursuant to this act \ncommits a misdemeanor of the second degree and shall, upon \nconviction, be sentenced to pay a fine of not less than one \nthousand dollars ($1,000.00) nor more than fifty thousand \ndollars ($50,000.00) for each separate offense or to \nimprisonment for a period of not more than two (2) years for \neach separate offense, or both.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-289", "section": "2", "title": "Any person who knowingly makes any false statement or", "text": "(2)\nAny person who knowingly makes any false statement or \nrepresentation in any application, record, report, certification \nor other document required to be either filed or maintained by \nthis act or the regulations promulgated under this act commits \n\n\nPage 77:\na misdemeanor of the second degree and shall, upon conviction, \nbe sentenced to pay a fine of not less than two thousand five \nhundred dollars ($2,500.00) nor more than fifty thousand dollars \n($50,000.00) for each separate offense or to imprisonment for \na period of not more than two (2) years for each separate \noffense, or both.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-290", "section": "3", "title": "Any person who negligently releases into the ambient", "text": "(3)\nAny person who negligently releases into the ambient \nair any hazardous air pollutant listed under section 112 of the \nClean Air Act or any extremely hazardous substance listed under", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-291", "section": "302(a)", "title": "(2) of the Superfund Amendments and", "text": "section 302(a) (2) of the Superfund Amendments and\nReauthorization Act of 1986 (Public Law 99-499, 100 Stat. 1613) \nthat is not listed in section 112 of the Clean Air Act and who \nat the time negligently places another person in imminent danger \nof death or serious bodily injury commits a misdemeanor of the \nthird degree and shall, upon conviction, be sentenced to pay a \nfine of not less than five thousand dollars ($5,000.00) nor \nmore than fifty thousand dollars ($50,000.00) for each separate \noffense or to imprisonment for a period of not more than one", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-293", "section": "1", "title": "Any person who knowingly releases into the ambient", "text": "(1)\nAny person who knowingly releases into the ambient \nair any hazardous air pollutant listed under section 112 of the \nClean Air Act or any extremely hazardous substance listed under", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-294", "section": "302(a)", "title": "(2) of the Superfund Amendments and", "text": "section 302(a) (2) of the Superfund Amendments and\nReauthorization Act of 1986 that is not listed in section 112 \nof the Clean Air Act and who knows at the time that he thereby \nplaces another person in imminent danger of death or serious \nbodily injury commits a felony of the first degree and shall, \nupon conviction, be sentenced to pay a fine of not less than \ntwenty-five thousand dollars ($25,000.00) nor more than one \nhundred thousand dollars ($100,000.00) per day for each \nviolation or to imprisonment for a period of not less than two", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-295", "section": "2", "title": "years nor more than twenty (20) years, or both. Any person", "text": "(2) years nor more than twenty (20) years, or both. Any person\nwhich is an organization committing such violation shall, upon \nconviction under this clause, be subject to a fine of not more \nthan one million dollars ($1,000,000.00) per day for each \nviolation. If a conviction of any person under this clause is \nfor a violation committed after a first conviction of such \nperson under this clause, the maximum punishment shall be \ndoubled with respect to both the fine and imprisonment. For any \nair pollutant for which the board has set an emissions standard \nor for any source for which a permit has been issued by the \ndepartment, a release of such pollutant in accordance with that \nstandard or permit shall not constitute a violation of this \nsection.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-296", "section": "2", "title": "In determining whether a defendant who is an individual", "text": "(2)\nIn determining whether a defendant who is an individual \nknew that the violation placed another person in imminent danger \nof death or serious bodily injury:", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-298", "section": "", "title": "", "text": "(ii)\nknowledge possessed by a person other than the \ndefendant, but not by the defendant, may not be attributed to \nthe defendant, except that, in proving a defendant's possession \nof actual knowledge, circumstantial evidence may be used, \nincluding evidence that the defendant took affirmative steps \nto be shielded from relevant information.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-299", "section": "3", "title": "It is an affirmative defense to a prosecution under", "text": "(3)\nIt is an affirmative defense to a prosecution under \nthis subsection that the conduct charged was freely consented \nto by the person endangered and that the danger and conduct \ncharged were reasonably foreseeable hazards of either of the \nfollowing: \n\n\nPage 78:", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-301", "section": "", "title": "", "text": "(ii)\nMedical treatment or medical or scientific \nexperimentation conducted by professionally approved methods \nand such other person had been made aware of the risks involved \nprior to giving consent. The defendant may establish an \naffirmative defense under this subclause by a preponderance of \nthe evidence.", "requirement_type": "optional", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-302", "section": "4", "title": "All general defenses, affirmative defenses and bars to", "text": "(4)\nAll general defenses, affirmative defenses and bars to \nprosecution that may apply with respect to other state criminal \noffenses may apply under this clause and shall be determined \nby the courts according to the principles of common law. \nConcepts of justification and excuse applicable under this \nsection may be developed according to those principles.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-303", "section": "5", "title": "For purposes of this subsection, the term \"organization\"", "text": "(5)\nFor purposes of this subsection, the term \"organization\" \nmeans a legal entity, other than a government, established or \norganized for any purpose, and the term includes a corporation, \na company, an association, a firm, a partnership, a joint stock \ncompany, a foundation, an institution, a trust, a society, a \nunion or any other association of persons. \n(d) \nFor purposes of subsections (b) and (c) of this section, \nthe term \"serious bodily injury\" means bodily injury which \ninvolves a substantial risk of death, unconsciousness, extreme \nphysical pain, protracted and obvious disfigurement or \nprotracted loss or impairment of the function of a bodily \nmember, organ or mental faculty. \n(e) \nFor purposes of this section, the term \"person\" \nincludes, in addition to the entities referred to in section \n3, any responsible corporate officer. \n(f) \nFor purposes of the provisions of subsections (b) and \n(c) of this section and section 9.1, the term \"operator,\" as \nused in such provisions, shall include any person who is senior \nmanagement personnel or a corporate officer. Except in the case \nof knowing and wilful violations, such term shall not include \nany person who is a stationary engineer or technician \nresponsible for the operation, maintenance, repair or monitoring \nof equipment and facilities and who often has supervisory and \ntraining duties, but who is not senior management personnel or \na corporate officer. Except in the case of knowing and wilful \nviolations, for purposes of clause (3) of subsection (b) of \nthis section, the term \"a person\" shall not include an employe \nwho is carrying out his normal activities and who is not a part \nof senior management personnel or a corporate officer. Except \nin the case of knowing and wilful violations, for the purposes \nof clauses (1) and (2) of subsection (b) and subsection (c) of \nthis section, the term \"a person\" shall not include an employe \nwho is carrying out his normal activities and who is acting \nunder orders from the employer. \n(g) \nFor purposes of this section, a person acts negligently \nwith respect to a material element of an offense when he should \nbe aware of a substantial and unjustifiable risk that the \nmaterial element exists or will result from his conduct. The \nrisk must be of such a nature and degree that the actor's \nfailure to perceive it, considering the nature and intent of \nhis conduct and the circumstances known to him, involves a gross \ndeviation from the standard of care that a reasonable person \nwould observe in the actor's situation. \n(9 amended July 9, 1992, P.L.460, No.95)", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-304", "section": "9.1", "title": "", "text": "Section 9.1.\ncivil Penalties.--(a) \nIn addition to \nproceeding under any other remedy available at law or in equity \nfor a violation of a provision of this act or any rule or \n\n\nPage 79:\nregulation promulgated under this act or any order, plan \napproval or permit issued pursuant to this act, the department \nmay assess a civil penalty for the violation. The penalty may \nbe assessed whether or not the violation was wilful. The civil \npenalty so assessed shall not exceed ten thousand dollars \n($10,000.00) per day for each violation which occurs in the \nfirst three (3) years following enactment of this section, \nfifteen thousand dollars ($15,000.00) per day for each violation \nwhich occurs in the fourth year following enactment of this \nsection and twenty-five thousand dollars ($25,000.00) per day \nfor each violation which occurs in the fifth year and all \nsubsequent years following enactment of this section. In \ndetermining the amount of the penalty, the department shall \nconsider the wilfulness of the violation; damage to air, soil, \nwater or other natural resources of the Commonwealth or their \nuses; financial benefit to the person in consequence of the \nviolation; deterrence of future violations; cost to the \ndepartment; the size of the source or facility; the compliance \nhistory of the source; the severity and duration of the \nviolation; degree of cooperation in resolving the violation; \nthe speed with which compliance is ultimately achieved; whether \nthe violation was voluntarily reported; other factors unique \nto the owners or operator of the source or facility; and other \nrelevant factors. \n(b) \nWhen the department proposes to assess a civil penalty, \nit shall inform the person of the proposed amount of the \npenalty. The person charged with the penalty shall then have \nthirty (30) days to pay the proposed penalty in full, or, if \nthe person wishes to contest the amount of the penalty or the \nfact of the violation to the extent not already established, \nthe person shall forward the proposed amount of the penalty to \nthe hearing board within the thirty (30) day period for \nplacement in an escrow account with the State Treasurer or any \nCommonwealth bank or post an appeal bond to the hearing board \nwithin thirty (30) days in the amount of the proposed penalty, \nprovided that such bond is executed by a surety licensed to do \nbusiness in the Commonwealth and is satisfactory to the \ndepartment. If, through administrative or final judicial review \nof the proposed penalty, it is determined that no violation \noccurred or that the amount of the penalty shall be reduced, \nthe hearing board shall, within thirty (30) days, remit the \nappropriate amount to the person with any interest accumulated \nby the escrow deposit. Failure to forward the money or the \nappeal bond at the time of the appeal shall result in a waiver \nof all legal rights to contest the violation or the amount of \nthe civil penalty unless the appellant alleges financial \ninability to prepay the penalty or to post the appeal bond. The \nhearing board shall conduct a hearing to consider the \nappellant's alleged inability to pay within thirty (30) days \nof the date of the appeal. The hearing board may waive the \nrequirement to prepay the civil penalty or to post an appeal \nbond if the appellant demonstrates and the hearing board finds \nthat the appellant is financially unable to pay. The hearing \nboard shall issue an order within thirty (30) days of the date \nof the hearing to consider the appellant's alleged inability \nto pay. The amount assessed after administrative hearing or \nafter waiver of administrative hearing shall be payable to the \nCommonwealth and shall be collectible in any manner provided \nby law for the collection of debts, including the collection \nof interest at the rate established in subsection (c) of section", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-305", "section": "3, which shall run from the date of assessment of the penalty.", "title": "If any person liable to pay any such penalty neglects or refuses", "text": "6.3, which shall run from the date of assessment of the penalty.\nIf any person liable to pay any such penalty neglects or refuses \n\n\nPage 80:\nto pay the same after demand, the amount, together with interest \nand any costs that may accrue, shall constitute a debt of such \nperson, as may be appropriate, to the Clean Air Fund. The debt \nshall constitute a lien on all property owned by said person \nwhen a notice of lien incorporating a description of the \nproperty of the person subject to the action is duly filed with \nthe prothonotary of the court of common pleas where the property \nis located. The prothonotary shall promptly enter upon the civil \njudgment or order docket, at no cost to the department, the \nname and address of the person, as may be appropriate, and the \namount of the lien as set forth in the notice of lien. Upon \nentry by the prothonotary, the lien shall attach to the revenues \nand all real and personal property of the person, whether or \nnot the person is solvent. The notice of lien, filed pursuant \nto this subsection, which affects the property of the person \nshall create a lien with priority over all subsequent claims \nor liens which are filed against the person, but it shall not \naffect any valid lien, right or interest in the property filed \nin accordance with established procedure prior to the filing \nof a notice of lien under this subsection.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-306", "section": "9.2", "title": "Disposition of Fees, Fines and Civil", "text": "Section 9.2.\nDisposition of Fees, Fines and Civil \nPenalties.--(a) \nExcept as provided under subsection (a.1), all \nfines, civil penalties and fees collected under this act shall \nbe paid into the Treasury of the Commonwealth in a special fund \nknown as the Clean Air Fund, hereby established, which, along \nwith interest earned, shall be administered by the department \nfor use in the elimination of air pollution. The department may \nestablish such separate accounts as may be necessary or \nappropriate to implement the requirements of this act and the \nClean Air Act. The board shall adopt rules and regulations for \nthe management and use of the money in the fund. \n(a.1) \nThe following shall apply:", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-307", "section": "1", "title": "If an incident results in the imposition of a fine or", "text": "(1)\nIf an incident results in the imposition of a fine or \ncivil penalty of at least fifty thousand dollars ($50,000), \ntwenty-five per centum (25%) of the fine or civil penalty \ncollected shall be returned by the department to the \nmunicipality in which the violation occurred to be used for \nprojects that eliminate or reduce air pollution or for parks, \nrecreation projects, trails or open spaces.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-308", "section": "2", "title": "The department shall notify the municipality in which", "text": "(2)\nThe department shall notify the municipality in which \nthe violation occurred of the imposition of the fine or civil \npenalty under subsection (a) within five (5) business days after \nthe expiration of the right to file an appeal of the fine or \ncivil penalty or after all appeals of the fine or civil penalty \nhave been exhausted.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-309", "section": "3", "title": "Within one hundred and eighty (180) days of the", "text": "(3)\nWithin one hundred and eighty (180) days of the \ndepartment's notification of the municipality under clause (2), \nthe municipality shall submit a project proposal to the \ndepartment for review and approval.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-310", "section": "4", "title": "Upon approval of the project, the department shall", "text": "(4)\nUpon approval of the project, the department shall \nrelease twenty-five per centum (25%) of the fine or civil \npenalty collected to the municipality. If the cost of the \nproject exceeds twenty-five per centum (25%) of the fine or \ncivil penalty, the department may award additional money from \nthe fine or civil penalty to the municipality.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-311", "section": "5", "title": "If all fines and civil penalties deposited into the", "text": "(5)\nIf all fines and civil penalties deposited into the \nClean Air Fund are less than one million eight hundred fifty \nthousand dollars ($1,850,000) for the previous fiscal year, \nclause (1) shall not apply for the current fiscal year.", "requirement_type": "mandatory", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}, {"id": "rule-REG-PA DEP of AIR QUALITY.pdf-312", "section": "6", "title": "If the united States Environmental Protection Agency", "text": "(6)\nIf the united States Environmental Protection Agency \nand the department jointly prosecute a violation of the Clean", "requirement_type": "informative", "source_document": "REG-PA DEP of AIR QUALITY.pdf", "page_number": "", "extraction_method": "rule_based"}]